{
    "0": {
        "product_id": "3055314192",
        "reviews": [
            {
                "title": "Solid TV, no complaints",
                "text": "The TV was extremely easy to program, user-friendly, and all the needed apps preloaded. For the size of the TV, the sound is phenomenal. Having ability to run it on AC or DC is a very nice benefit. We installed this on our boat in the guest state room, we received favorable feedback from our guests.\nIf I could, one recommendation, for the manufacture, would be to add the ability to adjust the sound, such as bass travel in mid range. Although the sound is phenomenal, I would like to get a little more base and reduce the mid range slightly. I strongly recommend this TV for your RV or boat.",
                "rating": 5
            },
            {
                "title": "Defective right out of the box",
                "text": "Had trouble getting unit turned on. Tried manually, then with remote, Screen remained black. After several attempts , switched on,, began set up %26 unit shut off. Screen went black and would not switch on. Unfortunate, it was nice unit, versatile, but would not stay on. Obviously defective. Sent it back.",
                "rating": 1
            },
            {
                "title": "Stunning Visuals, TopNotch Service!",
                "text": "I'm beyond impressed with both the smart RV TV and the seller's exceptional service. The TV's intelligence truly stands out, seamlessly integrating with my RV lifestyle. The smart features are a gamechanger, making navigation and streaming effortless. The picture quality is topnotch, delivering vibrant colors and crisp details, turning every movie night into a cinematic experience. The sound quality is equally impressive, creating an immersive audio environment within the confined space of my RV.",
                "rating": 5
            },
            {
                "title": "Solid TV, no complaints",
                "text": "The TV was extremely easy to program, user-friendly, and all the needed apps preloaded. For the size of the TV, the sound is phenomenal. Having ability to run it on AC or DC is a very nice benefit. We installed this on our boat in the guest state room, we received favorable feedback from our guests.\nIf I could, one recommendation, for the manufacture, would be to add the ability to adjust the sound, such as bass travel in mid range. Although the sound is phenomenal, I would like to get a little more base and reduce the mid range slightly. I strongly recommend this TV for your RV or boat.",
                "rating": 5
            },
            {
                "title": "",
                "text": "Arrived earlier than expected, consistent with the description. Satisfactory customer service. On time, a very safe shopping trip. Multiple user accounts can be set up.",
                "rating": 5
            },
            {
                "title": "",
                "text": "The product is superior. It'll be here soon. Great quality. I will buy from this seller again! HDMI and USB ports for easy connection to other devices",
                "rating": 5
            },
            {
                "title": "Great customer service",
                "text": "Very helpful. Took care of all concerns",
                "rating": 5
            },
            {
                "title": "Fantastic.",
                "text": "Great merchandise at a fantastic price. I also like mention that I often find items that are hard to find anywhere else .",
                "rating": 5
            },
            {
                "title": "",
                "text": "Products received in time, the price is good, it is recommended to buy the seller's service attitude is very good, the delivery speed is very fast, the express is very good! Powerful processor and plenty of storage space for smooth running of applications",
                "rating": 5
            },
            {
                "title": "Everything is great",
                "text": "This RV TV made our trip more enjoyable!",
                "rating": 5
            },
            {
                "title": "Great for RV",
                "text": "This tv has a clear nice picture and was super easy to set up. I was able to set it up in the house before mounting it in the RV .  Very happy with this unit.",
                "rating": 5
            },
            {
                "title": "Defective right out of the box",
                "text": "Had trouble getting unit turned on. Tried manually, then with remote, Screen remained black. After several attempts , switched on,, began set up %26 unit shut off. Screen went black and would not switch on. Unfortunate, it was nice unit, versatile, but would not stay on. Obviously defective. Sent it back.",
                "rating": 1
            },
            {
                "title": "",
                "text": "Good price, great product. Finally found a good store, good service, good quality, the next chance to buy again. Connect game consoles and other entertainment devices to make your entertainment more diverse.",
                "rating": 5
            },
            {
                "title": "",
                "text": "The quality is the best and the price is acceptable. It was exactly as described, arriving much faster than expected. Quality assurance, can be assured to buy and use.",
                "rating": 5
            },
            {
                "title": "",
                "text": "Same day delivery! Strong ability, suitable for long time use. Support for automatic search of TV channels, so you do not need to manually tune channels.",
                "rating": 5
            },
            {
                "title": "",
                "text": "This product is very good and delivered on time! The service is very good and the product is very varied. I really like this store. Built-in smart chip, so that you use more intelligent.",
                "rating": 5
            },
            {
                "title": "",
                "text": "Supports a variety of audio formats, including MP3, WMA, AAC, etc. Packaged well, great product, thanks for service. Go ahead and buy it. I promise you won't regret it. That's great!",
                "rating": 5
            },
            {
                "title": "",
                "text": "Built-in WiFi, wireless connection to the Internet can be said to be inexpensive, the price is not expensive. Overall, it's pretty good. Fine design, beautiful atmosphere.",
                "rating": 5
            },
            {
                "title": "",
                "text": "There are some compatibility issues with the Android 11.0 system. After using it for a week, there was a slower running speed situation. I hope to improve and upgrade the system.",
                "rating": 1
            },
            {
                "title": "",
                "text": "The appearance is fashionable and simple, suitable for different home decoration style good products! Nice. Okay. Arrived safely. Thank you very much!",
                "rating": 5
            },
            {
                "title": "",
                "text": "Suitable for a variety of RV models, including travel trailers, motorhomes, etc. Good goods, reasonable prices. Affordable, cost-effective outstanding.",
                "rating": 5
            },
            {
                "title": "",
                "text": "High quality display allows you to enjoy a clearer picture. Detailed description, the actual product is consistent, thank you! It's a gift, but it's already here. On time. The transaction went well.",
                "rating": 5
            }
        ]
    },
    "1": {
        "product_id": "887644368",
        "reviews": [
            {
                "title": "TV on a budget",
                "text": "I bought this television because of the price. I did read other reviews and decided to grab it. I have had higher quality TV's it the past and I would say the quality of the picture does not compare to higher priced Samsung I owned . However, for the price this is a great tv. So no regrets. Would recommend if you are on a budget like I am.  With the inflated rates of everything I am happen.",
                "rating": 4
            },
            {
                "title": "Black screen once set up!!",
                "text": "After mounting the tv on the wall. I went through initial updates and started setting up my streaming channels. Before I finished, the screen went black. I researched and went through several processes to get it to work, but nothing worked. The screen flickered a couple of times but wouldn't come on and stay on. I'm frustrated, disappointed and aggravated that I have to disassemble and pack it up to return it!!!",
                "rating": 1
            },
            {
                "title": "TCL 75",
                "text": "1st off when I bought the TV I reluctantly picked Shipping because I didn't think I could pick it up and I'm very glad I did. The TV came with in 4 hours of me ordering, and it is Huge, there was no way I could have picked it up. Taking it out the box the TV Screen is gorgeous, it's very easy to setup as it's a Roku TV and I already had a Roku Account. I am absolutely satisfied with the Purchase. Price was too good to pass up. Loving it so far.",
                "rating": 5
            },
            {
                "title": "Very nice product",
                "text": "So far, this TCL TV is great. Nice picture, Roku, etc. just as expected. To me, TVs are a 10 year max investment since technology changes so much. Even if it only lasts 5 years, that's $50/year or <$5/month. But I think it will last a long time!  Will buy again.",
                "rating": 5
            },
            {
                "title": "Great TV!",
                "text": "Works well. We currently have it mounted on a tv stand and it has been great.  It works well with the sound bar too! Our last tv didn't have a way to connect it so it had to be done by Bluetooth. We had to use separate remotes. With this tv, it's one remote because we don't have to connect it with Bluetooth. It comes on automatically with the tv. Probably helps that the sound bar is the same brand though.",
                "rating": 5
            },
            {
                "title": "Honest Technical Review - Image Adjustment Detail",
                "text": "I bought TCL 55\" Class 4-Series 4K UHD HDR Smart Roku TV - 55S451 to replace a 5 year old model HiSense 55\" 4K TV.  \n\nPICTURE QUALITY\nWhile the picture brightness isn't quite as bright as what I'm used to, the image quality is outstanding for the price.  TCL team if you are reading this, you will need to improve in this area to stay competitive with other manufacturers.\n\nTo maximize the picture quality, here are the settings that I used. \n1. TV Brightness = \"Brighter\"\n2. Picture Mode = \"Vivid\"\n3. Customize Picture > Back Light = \"100\"\n4. Customize Picture > Brightness = \"50\"\n5. Customize Picture > Contrast = \"100\"\n6. Customize Picture > Sharpness = \"50\"\n7. Customize Picture > Color = \"60\"\n8. Expert Settings > Dynamic Contrast = \"High\"\n9. Expert Settings > Gamma Correction = \"2.4\"\n10. Expert Settings > Noise Reduction = \"High\"\n11. Expert Settings > Color Temperature = \"Cool\"\n12. Expert Settings > Color Space = Default Setting\n13. Expert Settings > Auto Setting = \"Standard\"\n\nOverall, I would say the whites in the picture are good but not great.  This would improve if the nit brightness were increased. The black colors with the adjustments above are very good.  \n\nSOUND QUALITY\nSound quality of the speakers is good for this TV.  Although I would like to see a menu option to change the Equalizer settings to adjust highs, mids, and lows.  This is especially important when adding a sound bar or external speakers. \n\nWALL MOUNTING\nWall mounting was straight forward.  TCL provided screws in the top two holes for wall mounting, however the bottom two holes are empty and you will need to bring your own hardware.  Not much of an issue there, however the mounting holes are a tad bit too low for my existing wall mount bracket setup.  Not all manufacturers have the same spacing design which is understandable; although, this design can be slightly improved. \n\nCONCLUSION\nI would gjve this TV an 8.5 out of 10 based on the value and overall quality of this model. \n\nGreat job TCL team!",
                "rating": 5
            },
            {
                "title": "Solid Television",
                "text": "I had an LG quit on me after 25 months but I bought this exact model I've been watching at my mom's house for nearly five years now.  So I bought another one for my bedroom.  I built a little stand to put in on because the feet were a bit wider than my chest of drawers where I kept my old one.",
                "rating": 5
            },
            {
                "title": "TV on a budget",
                "text": "I bought this television because of the price. I did read other reviews and decided to grab it. I have had higher quality TV's it the past and I would say the quality of the picture does not compare to higher priced Samsung I owned . However, for the price this is a great tv. So no regrets. Would recommend if you are on a budget like I am.  With the inflated rates of everything I am happen.",
                "rating": 4
            },
            {
                "title": "Damaged TV  that completely ruined a surprise gift",
                "text": "Heard great things about this TV regardless of the price nothing else TCL but this particular one looks like I've been returned. I was toes brand new should be a red flag when I open the box and the power cable for the TV was already connected to the TV batteries already in the remote, no warranty card no owners manual, none of that they're supposed to be for screws. The screw bag was open and there was only two screws so I was just have been returned. Also noticed it looks like I've been dropped at the top left corner. Yay.!",
                "rating": 1
            },
            {
                "title": "Broke in two months. Terrible.",
                "text": "Got this TV for the big size and at first i loved the TV. The Roku integration is very nice, the speakers are pretty good. But i owned the TV for only two months and the screen is already broken. Black lines across the TV, and it's only getting worse over time. I'll leave the TV off for a week or so, turn it back on and it's worse than before. Even started flickering under certain colors. Absolutely horrible!!!",
                "rating": 1
            },
            {
                "title": "Black screen once set up!!",
                "text": "After mounting the tv on the wall. I went through initial updates and started setting up my streaming channels. Before I finished, the screen went black. I researched and went through several processes to get it to work, but nothing worked. The screen flickered a couple of times but wouldn't come on and stay on. I'm frustrated, disappointed and aggravated that I have to disassemble and pack it up to return it!!!",
                "rating": 1
            },
            {
                "title": "Cracked Screen",
                "text": "Got as a Christmas gift. Installed it on the wall and turned it on just to realize the screen was cracked. Returned back to Easley Wal Mart and the lasdy at customer service was very rude. They just put the money back on the affirm account so have to wait five business days to redo everything all over again.",
                "rating": 1
            },
            {
                "title": "Nice, inexpensive smart television",
                "text": "This tv has been great.  Our previous tv was not a smart tv and we did all of our streaming through a game console that had suddenly quit working.  We opted for a smart tv the same size as our older tv.  This tv was a good price and had good ratings online.  We are very happy with our purchase and would recommend this tv to others.",
                "rating": 5
            },
            {
                "title": "Perfect",
                "text": "I love this TV it works perfectly but it maybe to soon to say how long it will last I've only had it for over 1 week. I'm hoping it will last more than the ONN 70” I had previously that one only lasted 1 year 8 months what a waste of money and the ONN people were rude didn't speak clear English like you we're talking to someone in a different country and they lied about me sending the warranty card in so they wouldn't even replace it or try to fix it. So hopefully this TV will last longer and if something happens to it they will handle it better",
                "rating": 5
            },
            {
                "title": "Totally Satisfied!",
                "text": "The TCL TV is excellent, beautiful picture, quality %26 sound. The set up was so easy, it practically set up by itself. It connected to XFinity quickly %26 easily with no problems at all. We already have a TCL TV prior to this one %26 we never had any problems with it, so this was an easy decision to make. I'm totally satisfied with my purchase!",
                "rating": 5
            },
            {
                "title": "Very disappointed with my purchase",
                "text": "I bought this television a few months ago and to be honest it was my frist  television i bought online, not expecting anything else but a 65\" as advertised, after all that's what I payed for, in my eye it look kinda off, but never really measured it...so I decided to buy another one,  I ask my son to measured it so we can compare with the 55\" I was deciding to get, to my surprise he told me, it was a 57\"....why you seller do this to hard working people....I living in the island so for me it's hard to ship back....y'all making walmart look really bad 👎",
                "rating": 1
            },
            {
                "title": "Love the TCL",
                "text": "This is our 3rd TCL purchase and love the picture and included tech.  All are still working - 5 years and going. This one is the largest and the picture is perfect.",
                "rating": 5
            },
            {
                "title": "Not happy",
                "text": "This TV has a weird anomaly on the lower right corner of the screen. Been like this since day one. Wondering if it was dropped at some point during delivery. Returning something like this isn't an option because it won't fit in my car.",
                "rating": 1
            },
            {
                "title": "HORRIBLE",
                "text": "Just got it in Walmart pick up today and brought it straight home, plugged it in and it's completely broken. Unbelievable. Returning first thing tomorrow.",
                "rating": 1
            },
            {
                "title": "Less than 6 months and tv is not working.",
                "text": "I just bought this TV February 22,2023 and it's not working. I turned the tv on August 12th and the screen is showing white I can only hear the sound.",
                "rating": 1
            },
            {
                "title": "TV not received",
                "text": "I received a photo as proof of delivery. In this photo, I can see a small package that was part of my order, but I don't see the TV package in this photo. I filed a complaint the same day, but they said I couldn't get a refund because the photo \"proved\" receipt. I bought the 43' TCL TV at Walmart's physical store and really liked the product, so I decided to buy a 55' online, but I had this problem and will never buy online again and I don't recommend it to anyone.",
                "rating": 1
            },
            {
                "title": "Damaged box, damaged tv - 0 stars",
                "text": "The box was damaged when it arrived. There was even packing tape on the box where it was damaged so pretty sure it came from the  store this way. I unpacked it to see if the TV was damaged. It looked fine. Until I plugged it in. The left side of the screen has lines on it like it was hit or got wet. It will be picked up by Walmart and replaced with a new one. I go e it 0 stars bc a tv in a damaged box never should have been delivered. But the app required you select at least one star.",
                "rating": 1
            }
        ]
    },
    "2": {
        "product_id": "298384909",
        "reviews": [
            {
                "title": "Hisense LOVING IT!",
                "text": "I love my new tv Hisense. Git rid of my Emerson TV  which was  good too . Had it for 10 years.\nNow this new Hisense I’m loving it. The color and everything. It has all the apps that I need. Will be buying a bigger one for my family room",
                "rating": 5
            },
            {
                "title": "Package has been open and wrong product.",
                "text": "I come home and looked like my package was open /returned to the store and Walmart resold it. Well I bought a Hisense tv  and I pulled out an element tv that looked like another customer put in the box and returned, finger prints all over it etc. very unhappy and will be making a trip to my local Walmart in the morning/ making phone calls.",
                "rating": 1
            },
            {
                "title": "good value",
                "text": "i bought 2 50 inch for our bedrooms and a 65  inch for our living room. easy set up and plenty of free stuff to watch.  simple remote and pretty decent sound.",
                "rating": 5
            },
            {
                "title": "Measurement Info!",
                "text": "I own other Hisense TVs and wanted this 50\".  I'm very happy with it as I knew I would be. For those who want to know the measurements so that you know what size tv stand you can use, my stand is 40\" wide. I took the off chance and tried it and it worked. The legs measure 38\" across and 9.5\" deep so I have and inch on each side left until I decide to get another stand in the future. The screen itself is 44' across, 23.5\" tall (28\" tall from the legs to the top of the screen) and about 50.5\" diagonal.  I hope this helps many of you with those questions. I really like this tv and hope you enjoy the picture and sound quality that I have come to know with mine.",
                "rating": 5
            },
            {
                "title": "Hisense LOVING IT!",
                "text": "I love my new tv Hisense. Git rid of my Emerson TV  which was  good too . Had it for 10 years.\nNow this new Hisense I’m loving it. The color and everything. It has all the apps that I need. Will be buying a bigger one for my family room",
                "rating": 5
            },
            {
                "title": "A great little tv if you think 50” is little.",
                "text": "Picture quality is excellent for the price and brightness is great. I am using this as a digital sign to display information in a school. We have standardized on Roku to make things easy with remotes and even applications. This also works well with other devices. We use a yodeck For some of our signage purposes.",
                "rating": 5
            },
            {
                "title": "Great Value",
                "text": "The purchase of this TV with the built-in Roku feature prevented  the use of adding additional devices in order to link into the streaming services. The picture quality is excellent for the price of the television.",
                "rating": 5
            },
            {
                "title": "Would recommend buying",
                "text": "Only reason I gave it a 4 start was because I ordered it , paid for it and was suppose to pick it up the next day just for them to give me the run around and tell me they didn’t have any in store . So I waited almost a MONTH to even get my tv !!! But the tv it’s self ? Pretty good especially for the price .",
                "rating": 4
            },
            {
                "title": "Cheap Quality",
                "text": "It’s not durable at all. Overall quality was just OK for the price around $250. But after 7 months of use there are lines started appearing on the screen and those are getting bigger. Seems like I cannot return after 6 months so it’s a waste of money.",
                "rating": 1
            },
            {
                "title": "price is enticing but dont fall for it. runaway",
                "text": "1st problem is from the factory. there is so much tape on the screen you risk damaging the screen pulling it off . you can even see that it puts pressure on the screen. if you successfully make ot through all the tape without damaging the tv works well for streaming but took an hour to get my Xfinity cable connected. when it was finally connected watched a football game.. it was not a clear picture. watching netflix hulu was great but watching my cable was like watching with my glasses off.\nthere were also rings on each side of the tv. you see them just enough for. it to be distracting . so i exchanged the tv for another 50 in hisense.\nIT HAD THE SAME RINGS ON IT!!! and picture from cable still wonky.\nit doesnt make sense I have a 65in Hisense from 5 years ago that is great.. quality control has just gone way down.",
                "rating": 1
            },
            {
                "title": "Package has been open and wrong product.",
                "text": "I come home and looked like my package was open /returned to the store and Walmart resold it. Well I bought a Hisense tv  and I pulled out an element tv that looked like another customer put in the box and returned, finger prints all over it etc. very unhappy and will be making a trip to my local Walmart in the morning/ making phone calls.",
                "rating": 1
            },
            {
                "title": "Defective product with no poor customer support..",
                "text": "Bottom half of the television display is darker and distorted. Contacted Hisense service and was informed that the TV was defective but no resolution has been offered to replacement the unit or refund it. Dissatisfied with the quality of the product and extremely frustrated with the poor customer service.",
                "rating": 1
            },
            {
                "title": "Nice size and clear pic",
                "text": "Love this TV! I saw it online but seeing it in store is what made me purchase it. The screen is large and very clear compared to another brand in this price range. Shipping was quick and nothing was broken so far I have no complaints.",
                "rating": 5
            },
            {
                "title": "Walmart sucks",
                "text": "Tv came to my house broken then I was accused of scamming by the manager at Cicero Walmart daric implied I was scamming him even after showing the receipt and snickering behind my back I've never felt like a thief",
                "rating": 1
            },
            {
                "title": "Love it!",
                "text": "My TV came in perfect shape, wrapped up very good in the box and it is everything i expected! I would definitely recommend buying, truly worth more than it cost.",
                "rating": 5
            },
            {
                "title": "Excellent Bang for Your Buck!",
                "text": "My TV died and I needed an inexpensive replacement FAST and this TV fit the bill. It's SMART, inexpensive, stocked at local stores and available for same-day delivery, and provides really rich images. So far it's been great! Definitely recommend!",
                "rating": 5
            },
            {
                "title": "Great TV",
                "text": "I love it. Really good display and super easy to start. My living room is dimly lit at night but still awesome display.",
                "rating": 5
            },
            {
                "title": "Positive Review.",
                "text": "Like the Roku Feature and it's Abilty to Find Internet Channels as well and Provide a Guide to follow, only Dislike is the lack of a number pad to go directly to a known Channel.",
                "rating": 5
            },
            {
                "title": "Locked up right away",
                "text": "TV went through the set up and after it installed updates went to a screen with Hisense Roku Tv on it and nothing else. Support was friendly and offered to send a tech out, but I think Ill return it. It is a nice picture though!",
                "rating": 2
            },
            {
                "title": "online",
                "text": "I bought it online and for pickup option  came busted and a started an online return and customer service was having issues saying it was non returnable",
                "rating": 2
            },
            {
                "title": "Amazing purchase. Highly recommend!",
                "text": "This is one of the most amazing purchases I've have made. Was skeptical at first because it's not a name brand that I'm familiar with BUT after reading the reviews",
                "rating": 5
            },
            {
                "title": "Poorly made",
                "text": "Wanted to pick up in store, but online only option was to have delivered. Came with the screen all smashed and frame on sides unattached. Returned it. Going to get different brand. Poorly made.",
                "rating": 1
            }
        ]
    },
    "3": {
        "product_id": "355048458",
        "reviews": [
            {
                "title": "Comfy and Elegant",
                "text": "These chairs were an absolute goldmine. They look extemely high end and elegant. Also the fabric is good quality and the chairs are comfy. They accent my study nicely and ill probably bring them downstairs into my living room!",
                "rating": 5
            },
            {
                "title": "received 3 parts of chair, no seller response",
                "text": "I received 3 parts of this chair. I'm guessing there is a second box somewhere but can't get a response from the seller. Tried to contact twice over a 4 day period, then tried to do a return and got a message to contact the seller. This is some aggravating nonsense, and I'm sick of it. Rating? A big fat \"O\"",
                "rating": 1
            },
            {
                "title": "Buy this!!!",
                "text": "Omgg i love this chair!! So easy to assemble too. Great buy!",
                "rating": 5
            },
            {
                "title": "Chair for living room.",
                "text": "Very nice and comfortable chair for the living room.",
                "rating": 5
            },
            {
                "title": "Great chair!",
                "text": "The chair is a lot better than I thought it would be. I figured a super cheap chair would be cheap quality. It's actually really nice and comfortable! Perfect for my office and really easy to put together.",
                "rating": 5
            },
            {
                "title": "Beautiful, Sturdy Chairs",
                "text": "We love these chairs! They are a great fit in our space. We were pleasantly surprised with how durable and comfortable they are. Although, I would recommend having additional support in the back of the seat like a pillow. They did arrive with a strange factory smell, but it faded by the next day.",
                "rating": 5
            },
            {
                "title": "Cozy Chair",
                "text": "I've been searching far and wide for the perfect chair for my cozy corner and this one fit the spot perfectly! Not only is it aesthetically pleasing but it's actually comfortable! Also super affordable unlike most like it! Took me 30 minutes to assemble all by myself and I am in love!",
                "rating": 5
            },
            {
                "title": "Comfortable and Sturdy",
                "text": "I actually love this hair and really didn't expect to love it as much as I do. It was easy to assemble, it is sturdy and comfortable to sit in.  I bought it for a guest bedroom, but put it in the family room when we had a lot of people over,  for extra seating.  Both men and women of different sizes commented that it is comfortable. Very pleased with this chair.",
                "rating": 5
            },
            {
                "title": "Super good deal!",
                "text": "Love this chair! Super sturdy and the right height I'm looking for. Matches the style I'm going for, minimal modern. Big enough for me and my 6'1 180 lb partner. \nIt does come a little wrinkly cause it was in a sealed vacuumed package. Hopefully those wrinkles go away. \nAssembly was easy and all prices came in good shape. \nThe color is beautiful, ivory off white.\nAnd the fabric is really nice feels like good quality. \nSuper good deal, price was low compared to other options I was looking at. \nHighly recommend!",
                "rating": 5
            },
            {
                "title": "I like the chair. I purchased for my bedroom",
                "text": "It's very cozy and seems to be sturdy \nVery pleased with it.",
                "rating": 5
            },
            {
                "title": "My wife love these",
                "text": "These chairs are perfect for our new sectional that just arrived",
                "rating": 5
            },
            {
                "title": "Comfy and Elegant",
                "text": "These chairs were an absolute goldmine. They look extemely high end and elegant. Also the fabric is good quality and the chairs are comfy. They accent my study nicely and ill probably bring them downstairs into my living room!",
                "rating": 5
            },
            {
                "title": "Very nice",
                "text": "I love it it is soft and durable but is shorter than I thought",
                "rating": 5
            },
            {
                "title": "Love the look of it",
                "text": "Very good quality for the price. Beautiful and sturdy.",
                "rating": 5
            },
            {
                "title": "Love it",
                "text": "Looks exactly as shown, it's the perfect size and texture with an unbeatable price.",
                "rating": 5
            },
            {
                "title": "Comfy chair",
                "text": "This chair is surprisingly comfortable. Putting it together was a bit of a struggle because the instructions were sort of unclear. But I got the hang of it and put it together myself in under an hour. My partner and I are plus size, and this chair is pretty comfortable for both of us. Worth the purchase!",
                "rating": 4
            },
            {
                "title": "received 3 parts of chair, no seller response",
                "text": "I received 3 parts of this chair. I'm guessing there is a second box somewhere but can't get a response from the seller. Tried to contact twice over a 4 day period, then tried to do a return and got a message to contact the seller. This is some aggravating nonsense, and I'm sick of it. Rating? A big fat \"O\"",
                "rating": 1
            },
            {
                "title": "pleasantly surprised!",
                "text": "i like the quality material, ease of assembly and overall look of chair.  while its not a comfy chair to lounge in for long periods of time it does make a statement in design. definitely worth the miney",
                "rating": 4
            },
            {
                "title": "nice chair",
                "text": "nice looking chair but cheaply made. I purchased for guest bedroom. I was happy that it was on-sale. It isn't worth $300, but $98 (sale price) was better!",
                "rating": 3
            },
            {
                "title": "Great buy!",
                "text": "Very inexpensive and very comfortable! And they look great too!",
                "rating": 5
            },
            {
                "text": "Great accent chair for small area love it",
                "rating": 5
            },
            {
                "text": "There is nothing good to say about this chair.",
                "rating": 1
            }
        ]
    },
    "4": {
        "product_id": "1110728798",
        "reviews": [
            {
                "title": "Great Chairs!",
                "text": "I was pleasantly surprised by the quality of these chairs. The hardest part of putting them together was getting them out of the box! The material is very nice and they are very comfortable. The shipping was very fast. 10/10 recommend!",
                "rating": 5
            },
            {
                "title": "Terrible quality build",
                "text": "The chair broke within the first time sitting on it. I am an 180 pound man and a chair this size should be able to hold me.",
                "rating": 1
            },
            {
                "title": "Less than 10 minutes to put together!!",
                "text": "Love this chair. Purchased for my work office but purchasing more for the den :)",
                "rating": 5
            },
            {
                "title": "Great value and very elegant!",
                "text": "This chair is very comfortable and sturdy, very elegant design.  Looks exactly like pictured.",
                "rating": 5
            },
            {
                "title": "Great Chair! Easy to Assemble, Overall good buy!",
                "text": "I purchased 2 of these chairs for my office. I LOVE them!! Very roomy, comfortable and easy to assemble. The color is bright and cheerful, exactly what I was hoping for.  The chairs are firm, but not so firm that they are uncomfortable. Just right.",
                "rating": 5
            },
            {
                "title": "Just like the picture not the description of color",
                "text": "It's not navy blue it's actually the peacock color in picture. I was nervous it would be actually navy but it is like the photo…which was great! Love the color easy to put together, seems sturdy. Not a relaxing chair but I wanted it more for an accent. Probably will get another to have 2",
                "rating": 5
            },
            {
                "title": "Bus operator",
                "text": "Easy to put together beautiful furniture",
                "rating": 5
            },
            {
                "text": "Arrived in 2 days and super easy to put together.. it's perfect and I love it",
                "rating": 5
            },
            {
                "title": "Perfect",
                "text": "Assembly was simple. All the pieces were wrapped separately. Package was secure and delivered timely. It's not the most comfortable chair but is quite sturdy and very attractive. It fit perfectly in the space as I imagined.",
                "rating": 5
            },
            {
                "title": "Great Chairs!",
                "text": "I was pleasantly surprised by the quality of these chairs. The hardest part of putting them together was getting them out of the box! The material is very nice and they are very comfortable. The shipping was very fast. 10/10 recommend!",
                "rating": 5
            },
            {
                "title": "Love!",
                "text": "Love how it looks! Easy to put together! Cushion is not very thick but overall happy with this chair!",
                "rating": 4
            },
            {
                "title": "Terrible quality build",
                "text": "The chair broke within the first time sitting on it. I am an 180 pound man and a chair this size should be able to hold me.",
                "rating": 1
            },
            {
                "text": "very modern and stylish",
                "rating": 5
            },
            {
                "title": "Happy with my purchase!",
                "text": "The chair is very solid and nice quality!  The color of navy blue did not quite match the actual color but the tealish color still will work in my room.  Easy to assemble too.  Very nice comfy chair for a great price!",
                "rating": 4
            },
            {
                "title": "Pleasantly surprised!",
                "text": "We bought two of these for our sun room and I'm impressed. They were packaged VERY well and nothing was damaged. Very easy to put together too. They're not super plush but they are great chairs!!",
                "rating": 5
            },
            {
                "title": "Cute mid-mod chair!",
                "text": "The color and mid-century design are lovely. The chair seat is wide and low, which I like but is very hard. Still very pleased with this chair.",
                "rating": 4
            },
            {
                "title": "perfect color",
                "text": "The color is perfect. I was concerned that the color would be a true Navy, but it's as the picture, more of a peacock blue. It could use a little better lumbar support. It's a firm chair. It was super easy to put together.  I'd buy it again.",
                "rating": 4
            },
            {
                "text": "Great product for a great price",
                "rating": 5
            },
            {
                "title": "It looks like a high quality chair. Well worth it.",
                "text": "This chair is very nice! Super easy to put together. Comfy to sit in.",
                "rating": 5
            },
            {
                "title": "Definitely Recommend this for",
                "text": "Item arrived extremely quickly within two days while it’s not put together I opened the box and the fabric is excellent and color just as predicted and I have no reason to think it won’t be able to be put together well. I also liked it shipped FedEx and they texted me immediately as they delivered it, which was very handy because it was going to rain. Would definitely recommend it.",
                "rating": 5
            },
            {
                "title": "OK for the price",
                "text": "For the price, I want expecting much. They're ok. The seat cushions aren't removable and the seams aren't entirely straight. There's a gap in the back where the seat back attaches to the base, and I don't think they'll last long with regular use. That being said, they are usable and of you're on a budget, they aren't terrible.",
                "rating": 3
            },
            {
                "title": "Handsome Chair",
                "text": "Love the chair.  The color, size,  and fabric are all as detailed in the product specifications.  Chair assembly took minutes.  Screw the legs in and glide the back into place, done. Just the pop of color needed in our space.  We are only using it as an occasional accent chair, so it should hold up well.",
                "rating": 5
            }
        ]
    },
    "5": {
        "product_id": "1162861792",
        "reviews": [
            {
                "title": "Classic and versatile style, fairly easy assembly",
                "text": "I can see why this is a popular piece — the style is classic and versatile to many decorative aesthetics.  Assembly was fairly easy, not too many parts to worry about.  Feels sturdy, my dogs have already jumped on it.  Looks perfect in my living room.\n\nNote: I put a different cover on the pillow it comes with.",
                "rating": 5
            },
            {
                "title": "Don't buy!!",
                "text": "There were scratches in the wood and the seller said they will compensate but no compensation. The product look is average , and scratches make it look ugly. Wood different shades are quite prominent",
                "rating": 1
            },
            {
                "title": "Great chair for the money.",
                "text": "It is lower to the floor like most mid century modern furniture but has a deep seat and works well for any size person. The material is nice and I love the muted greenish /gray color.  It comes with a very small cushion for back support but I switched it out for a thicker accent pillow. I'm 5'4” tall and 135 pounds so I needed that for optimal comfort. I highly recommend this chair. It was easy to assemble.",
                "rating": 5
            },
            {
                "title": "Great chairs and excellent value",
                "text": "We were looking for a couple of relatively inexpensive accent chairs to replace a couple of uncomfortable chairs we had in our back room. What a bargain and the chairs are beautiful and well made. Solid wood frame, thick comfortable cushions and love the style. Very happy with this purchase.",
                "rating": 5
            },
            {
                "title": "Love them!",
                "text": "Love these chairs! The color is perfect, a muted green but adds the perfect pop of color. They look beautiful. Just a bit tough to attach the sides but overall easy assemblyz",
                "rating": 5
            },
            {
                "title": "Simple, modern and perfect.",
                "text": "Absolutely love these chairs! I have them in our sunroom/ playroom so they get frequent usage. A little difficult to get the screws aligned, but not impossible. Chairs are really comfortable. The seat cushion is thick and substantial. Chairs have a simple Scandinavian vibe and the neutral fabric should match with most decor.",
                "rating": 5
            },
            {
                "title": "Classic and versatile style, fairly easy assembly",
                "text": "I can see why this is a popular piece — the style is classic and versatile to many decorative aesthetics.  Assembly was fairly easy, not too many parts to worry about.  Feels sturdy, my dogs have already jumped on it.  Looks perfect in my living room.\n\nNote: I put a different cover on the pillow it comes with.",
                "rating": 5
            },
            {
                "title": "Super cute MCM chairs",
                "text": "Love how cute these chairs are! I had a little difficulty lining up the screws on the first one but got the hang of it by the second chair. Haven't had them long but the quality seems good so far.",
                "rating": 5
            },
            {
                "title": "Great for the price point!",
                "text": "I was nervous to try these, however I finally went for it since two of these are the same price as one mid century modern chair from Target. The fabric and the wood is beautiful and feels like good quality. It took about 20 minutes to assemble each chair. The longest part was simply getting the padding off each piece. They were packaged wonderfully. The biggest con that makes these 4 start for me is that they are very firm and there isn't much padding in the back. I added a pillow to it for now for comfort and might add a better lumbar pillow. The pillows that came with them were awkwardly small. Overall these are very stylish, affordable chairs that I won't mind my dog and kids living in.",
                "rating": 4
            },
            {
                "title": "Cheap quality as expected, but surprisingly comfy!",
                "text": "Ordered 2 of the green colored chairs—they're super cute and a great size, but the quality is just okay. 1 chair was broken but I was able to return and get a replacement the next day. However, all 3 chairs I received came with bolts that were too short to use. I had to go to a hardware store to buy longer ones which was a huge hassle. Then when the other chair arrived, we realized if you switch the right and left legs, the bolts they give you will work (for some reason the holes in the legs are different girths depending on which side you put them in from). However, that chair also had the holes in the cushions misaligned so it took two people to fit everything together. But that's what you get when you buy such a cheap chair. Because it's so cheap I was worried it would be uncomfortable—however the seat cushion is comfy! The back cushion is kind of stiff but with a pillow it's fine. The photo in the ad makes it look slightly darker green and kind of suede/soft but it's really linen and almost like a soft denim type material.",
                "rating": 3
            },
            {
                "title": "It would be perfect if it were comfortable!",
                "text": "Extremely cute chair! I love the MCM style and the color green is exactly what I was looking for. I also like that it comes with a pillow. As much as I like the look of this chair, I do not like that I will never be able to sit on it.  This chair is as hard as a rock! I don't even think it's worth trying to break it in so I will be returning it.",
                "rating": 2
            },
            {
                "title": "Don't buy!!",
                "text": "There were scratches in the wood and the seller said they will compensate but no compensation. The product look is average , and scratches make it look ugly. Wood different shades are quite prominent",
                "rating": 1
            },
            {
                "title": "Disappointed. Did not receive a set of 2",
                "text": "I ordered set of 2 amchairs ( was looking for additional seating to host guests tomorrow)\nThoroughly disappointed I got a.box delivered with just one armchair while I have paid for the the price of 2!",
                "rating": 1
            },
            {
                "title": "Nice",
                "text": "Gave the look I was going for",
                "rating": 4
            },
            {
                "text": "Good quality. Deep seats. Just like pictures!",
                "rating": 5
            },
            {
                "title": "Rocker",
                "text": "Low to floor big seat comfortable",
                "rating": 5
            },
            {
                "title": "Don't buy if you plan on sitting in it.",
                "text": "The quality is great but it's terribly uncomfortable and the color is WAY off.",
                "rating": 2
            },
            {
                "title": "Beautiful chair!",
                "text": "Really beautiful!! And super easy to put together.",
                "rating": 5
            },
            {
                "title": "Great Chairs",
                "text": "I love these chairs. They are sturdy. They are modern looking and adds style to my living room. Love them.",
                "rating": 5
            },
            {
                "title": "Beautiful chairs",
                "text": "Chairs are beautiful and sturdy. Fast delivery and easy set up.",
                "rating": 5
            },
            {
                "title": "Accent chairs",
                "text": "These chairs are sturdy and comfy very modern",
                "rating": 4
            },
            {
                "title": "Cute!",
                "text": "Very cute like online! I was expecting it to be a little lighter than it is but it's still a very nice beige color! Pretty easy to assemble but you will need 2 people. The chairs I got did come with some minor defects (like loose string, holes for the screws were not drill nicely etc but still made it worked). The only thing I didn't like was that there was some wood particles on the linen cushions, like all over it. I had to vacuum the whole thing and then lint roll it to ensure my kids won't be getting splinters.",
                "rating": 4
            }
        ]
    },
    "6": {
        "product_id": "296647135",
        "reviews": [
            {
                "title": "nice shirt",
                "text": "This is a nice dress shirt. it seems to be true to size and looks good on. \nmy son needed a white dress shirt for high school graduation, and it worked great.",
                "rating": 5
            },
            {
                "title": "Forgot I even ordered this",
                "text": "I've been in the same industry for going in 19 years in 2024. I haven't always had to wear specifically a black shirt like this but have shopped at Wal-Mart for them and like shirts of different colors for over half my life. I picked up some event shifts close to Christmas and throughout the new year, and when evaluating what I had, I decided on a whim to add this to my order, so I'd look a little more sharper than I would have wearing my faded black shirts from the past. After today's order arrived and I was checking it, I was asked to submit a review of this delivery, and because (I can only imagine) I was so busy the day it was being delivered and probably running late, I just put on the best looking shirt I had available not even thinking. (It has probably been 2-3 years since my last purchase of a long sleeved black shirt for work.  Upon literally quadruple checking, I don't even own a 2xl black long sleeve button up shirt, which makes more sense now as I have XL only and the one I wore felt tight as could be making me self conscious about gaining weight although the scale didn't budge much. Hoping I can figure out how to get this fixed, as I could really use that new black shirt! Tonight to be exact! Smh",
                "rating": 1
            },
            {
                "text": "This is a really nice shirt and seems true to size. It does very well when laundered with no shrinkage, fading, or pilling.",
                "rating": 5
            },
            {
                "text": "THESE SHIRTS ARE BEAUTIFUL.  I BOUGHT TWO FOR MY BROTHER.  THE NAVY AND BLUE GINGHAM AND THE NAVY GINGHAM.",
                "rating": 5
            },
            {
                "title": "nice shirt",
                "text": "This is a nice dress shirt. it seems to be true to size and looks good on. \nmy son needed a white dress shirt for high school graduation, and it worked great.",
                "rating": 5
            },
            {
                "title": "No Wrinkles",
                "text": "Loved it, fits so well! No wrinkles, stayed sleek and looked great for my son's Band concert! He looked so professional! No",
                "rating": 5
            },
            {
                "title": "Quick to arrive. Nice shirt.",
                "text": "Easy to iron. A little itchy. Could be softer fabric.  But that changes over washing it a few times. Does fade eventually.",
                "rating": 5
            },
            {
                "title": "Good deal and looks nice too.",
                "text": "It was a good fit and the price was great!\nIt served my needs for work.\nWould recommend.",
                "rating": 4
            },
            {
                "title": "Medium quality",
                "text": "Puckered stitching. Not highest quality.",
                "rating": 3
            },
            {
                "title": "Disappointed",
                "text": "I ordered a long sleeve shirt and I got a short sleeve shirt. How do I return it and get a long sleeve white shirt.",
                "rating": 1
            },
            {
                "title": "False Advertisement",
                "text": "the one thing I used to like about the shirts from Walmart was they were stretch collar. there was a band in the collar that would stretch out and give you relief on the neck. well now the button is a fixed button but the package still says it's a stretch collar. and now they're no longer package the shirts and plastic wrap so some of them are nasty and dirty because they've been on the floor and stepped on. and for all of this they charge you $5 more than they used to.",
                "rating": 1
            },
            {
                "title": "Forgot I even ordered this",
                "text": "I've been in the same industry for going in 19 years in 2024. I haven't always had to wear specifically a black shirt like this but have shopped at Wal-Mart for them and like shirts of different colors for over half my life. I picked up some event shifts close to Christmas and throughout the new year, and when evaluating what I had, I decided on a whim to add this to my order, so I'd look a little more sharper than I would have wearing my faded black shirts from the past. After today's order arrived and I was checking it, I was asked to submit a review of this delivery, and because (I can only imagine) I was so busy the day it was being delivered and probably running late, I just put on the best looking shirt I had available not even thinking. (It has probably been 2-3 years since my last purchase of a long sleeved black shirt for work.  Upon literally quadruple checking, I don't even own a 2xl black long sleeve button up shirt, which makes more sense now as I have XL only and the one I wore felt tight as could be making me self conscious about gaining weight although the scale didn't budge much. Hoping I can figure out how to get this fixed, as I could really use that new black shirt! Tonight to be exact! Smh",
                "rating": 1
            },
            {
                "title": "Reasonable value for the price",
                "text": "The shirt size tends to run smaller than normal. The material is adequate in quality. The sewing is good. If you are expecting  Arrow or Van Heusen dress shirt quailty, then this shirt may not quite measure up. But, again, for the money ...",
                "rating": 3
            },
            {
                "text": "The quality is not bad for the price. However, they are  supposed to be classic fit but they fit too close, more like slim fit. Very uncomfortable as I like looser fitting shirts. Will not order again.",
                "rating": 1
            },
            {
                "title": "used to be waaaay better",
                "text": "I used to love these shirts and bought many for my restaurant serving job. However, the quality is now horrible! Shirts used to be a fairly soft, brushed cotton blend, and now are a semi shiny polyester blend that feels and looks cheap and is much stiffer. Plus (maybe this is only something that matters to me), but the buttons are now off too - have to button up higher than before). ugh. Going to find a new place to purchase my work shirts.",
                "rating": 3
            },
            {
                "title": "Walmart saved the day!",
                "text": "Walmart saved the day for me! My daughter was getting married at the hotel we were staying at in Dallas. I realized 3 hours before the wedding that I forgot my dress shirt. I didn't think I had enough time to go home and get back for the wedding so I tried Walmart . They got the shirt to me an hour before the wedding. I had time to iron it and walked my daughter down the aisle! Thank you Walmart!",
                "rating": 5
            },
            {
                "title": "Quality, Good, Fit, Wrinkle Resistant, Great Price",
                "text": "Due to a change in my company's dress code, I needed to find a black, button down shirt that would look great %26 withstand repeated washing, a shirt that would be wrinkle resistant so I wouldn't have to be at the ironing board day after day. This shirt was perfect! I had to buy a few %26 the price didn't hurt my budget. It fits well %26 I even get compliments on it. It also came with collar stiffeners which I usually find in nicer quality shirts.",
                "rating": 5
            },
            {
                "text": "I love the fabric of these shirts. It's super smooth to the touch and has the perfect amount of stretch while still looking crisp.  I just wish the collar buttoned down.",
                "rating": 5
            },
            {
                "title": "the buttons did not line up with botton holes",
                "text": "you need to make return process available as pick up. returns not an easy process. I had items delivered to me and paid. why can't return method be the same with pick up available.",
                "rating": 1
            },
            {
                "title": "Runs too bug",
                "text": "The shirt is ok, but it runs way too big and loose for me for it's size. They should really modernize the way these shirts fit. The pattern is ok, not great.",
                "rating": 3
            },
            {
                "title": "Great Basic Shirt",
                "text": "Bought it for my dad's funeral. He never got to wear it. Family decided on a dingy off white shirt instead. Still kind of sore about that. He should have been buried in this shirt instead.",
                "rating": 5
            },
            {
                "title": "Walmart can't see to get the color correct.",
                "text": "I think the shirt is fine. The problem is I have ordered it in white 3 time so far and they keep sending it in grey. I double check and sure enough, I've ordered white but some numskull at the warehouse can't seem to tell the difference between white and grey - even when the tag is clearly marked. I gave up and went with Men's Warehouse. They know the difference between white and grey.",
                "rating": 1
            }
        ]
    },
    "7": {
        "product_id": "783399276",
        "reviews": [
            {
                "text": "Nice fits right",
                "rating": 5
            },
            {
                "title": "Order cancelled",
                "text": "Ordered on Wednesday May 22 with promised delivery on Thursday May 23. Notified that order was delayed and no further updates until now, Saturday May 25 saying that you have cancelled the order. I was supposed to gift these shirts to 2 young men to wear to church tomorrow.\nVery disappointed.",
                "rating": 1
            },
            {
                "title": "Shocked",
                "text": "I was Leary about ordering shirts from Walmart but I am completely satisfied",
                "rating": 5
            },
            {
                "text": "I use them for work and have purchased them several times over the past years.  The pocket is a plus, quality is good and price is affordable I like having five shirts to wear for the week.",
                "rating": 5
            },
            {
                "rating": 5
            },
            {
                "text": "Nice fits right",
                "rating": 5
            },
            {
                "title": "Interview clothing",
                "text": "100% satisfaction",
                "rating": 5
            },
            {
                "rating": 5
            },
            {
                "title": "Best work shirts EVER!!",
                "text": "I’ve been buying these(as a woman) for work for years! They are hands down the best value, they are comfy, easy to wash and best part is they last forever. I’ve had one for about ten years of on/off restaurant work!",
                "rating": 5
            },
            {
                "title": "Medium quality",
                "text": "Not the highest quality of sewing",
                "rating": 3
            },
            {
                "title": "Decent but could be better",
                "text": "I ordered one shirt and the collar came sticking to the package came in with residue. Not very impressed. The whole shirt didn't seem new for some reason. Otherwise very decent product. The sleeves are a little bit long on me and seeing as there's no option other than large and extra large but the sleeve size is standard that's also inconvenient.",
                "rating": 2
            },
            {
                "title": "Order cancelled",
                "text": "Ordered on Wednesday May 22 with promised delivery on Thursday May 23. Notified that order was delayed and no further updates until now, Saturday May 25 saying that you have cancelled the order. I was supposed to gift these shirts to 2 young men to wear to church tomorrow.\nVery disappointed.",
                "rating": 1
            },
            {
                "title": "Inexpensive - Poor Quality",
                "text": "First of all, why has the company gone away from listing the shirts with neck size and sleeve length? Selecting one of your size offerings makes no sense. So the neck size was fine but the sleeves were a little too long. Also, the first time I ordered I was sent short sleeve shirts when I ordered long sleeves. I went to my local store and returned them. The second order had neither shirt in the clear plastic bags and one sleeve was stained and torn. What they say is true. You get what you paid for.",
                "rating": 2
            },
            {
                "title": "Wish for 100% version",
                "text": "Overall, pretty good. I've loved George items for ages, which led me to choose this shirt. Neck size was right on the money. The cuffs seem tight to me, and I have small wrists. My only real complaint, which I obviously knew going in, is that there's no 100% cotton variety. I run hot, and poly blends don't help. Nevertheless, I would buy again for the fit and overall quality.",
                "rating": 3
            },
            {
                "text": "I got a men’s size medium for work. I’m 5’3 and weigh about 160 the men medium fit me perfect if you’re around my size or height for women.",
                "rating": 5
            },
            {
                "title": "Not guilty",
                "text": "This shirt was perfect for the verdict I was hoping for. If you want to look innocent when you know you aren't, this is the shirt you want for court.",
                "rating": 5
            },
            {
                "title": "Crisp white linen ready for formal/casual event!",
                "text": "Crisp snowy looking white shirt pressed and ready to wear to any occasion! The neckline comes with a piece of plastic to make sure the crease there remains intact and perfect until it’s time to put it on!",
                "rating": 5
            },
            {
                "title": "Best Price and Best Quality.",
                "text": "Can't never go wrong with George Men's Long Sleeve Dress Shirt. Price is so good that I can be confident and less careful for actions. Quality never changed over the past 4 years.",
                "rating": 5
            },
            {
                "title": "ok dress shirt in a pinch",
                "text": "for the price it's an ok dress shirt if you're in a pinch for time. they won't let you try on dress shirts at store. good luck choosing right size. returns also get questions when the shirt was never worn !!",
                "rating": 3
            },
            {
                "title": "very nice dress shirt for church!!!",
                "text": "I bought these dress shirts for my son for church. He loves them says they are very comfortable. And I love that there wrinkle free and when he goes to church he looks very handsome!!!",
                "rating": 5
            },
            {
                "text": "At $15 dollars, the price can't be beat. After reading a couple of the reviews, I was concerned that it would be made of very thin fabric, but the fabric was ok... I would call it medium weight.",
                "rating": 5
            },
            {
                "title": "Better quality than you would expect",
                "text": "I was hesitant to buy this, but overall impressed. The material is thick enough he doesn’t have to wear an undershirt. Irons nicely. Collar sets up nicely. Good price - good value.",
                "rating": 5
            }
        ]
    },
    "8": {
        "product_id": "1438709872",
        "reviews": [
            {
                "title": "Amazing",
                "text": "All perfect, thanks 😊",
                "rating": 5
            },
            {
                "title": "I did not receive my full order.",
                "text": "I did not receive my whole order. I ordered one 2x and two large shirts, but they only sent one 2x and one large. I tried to let them know, but the only way to reach out is to request a refund and the only way to do that is to send an item back. How do you send and item back if you don't have it. Very disappointed. I purchased the shirts for my boys to wear for Easter Sunday and now I have to figure something else out.",
                "rating": 1
            },
            {
                "title": "GREAT gift for all the men in family",
                "text": "I got this shirt as gifts for my dad and brother in law . They are good quality and both guys absolutely love them .\nI ended up ordering them in red and blue as well .",
                "rating": 5
            },
            {
                "title": "Amazing",
                "text": "All perfect, thanks 😊",
                "rating": 5
            },
            {
                "title": "My 12 yr old loves it!",
                "text": "I Bought this for my son. He's  in a medium men's and just turned 12. It fits great and is very soft. He looks nice, and said it's really comfortable! I'm gonna purchase in more colors for him. You can't beat the price,and especially for a polo shirt!",
                "rating": 5
            },
            {
                "title": "Perfect!!!",
                "text": "Perfect fit. Not too tight, not too baggy.\nFabric is amazing! Super soft cotton! \nType of fabric that won't get fuzzy balls.\nThe price is insane! Bought in every color for me and my husband so we can match and be comfy! Looks great on ladies too!!!!! Not posting pic of myself lol XL for 5'5'' ish",
                "rating": 5
            },
            {
                "title": "As described",
                "text": "Its exactly what you would expect from a shirt from walmart. Its comfortable, a bit thin, but looks nice. No ones gonna think you paid $30 for it, but it feels better than many knit shirts.",
                "rating": 4
            },
            {
                "title": "NOT Cotton",
                "text": "Despite what the description says this is polyester.  For the cheap price they are offering it ($8 right now) it is worth it.  But, the fit isn't quite right, the back is sewn a bit bigger than the front so it is off a bit.  But, it's cheap.",
                "rating": 3
            },
            {
                "text": "It was a good shirt. You had good material, but it did not look as I said. It was not like what I thought it would be. That's gonna be a tight shirt. It was large shirt, but I don't mind still a good material. People should buy stuff yeah and get some people some presents man, want some free stuff because I'm like a highschooler and that broke it the delivery delivered for like three days or two that's the good thing about it I say and some other stuff like free shipping or stuff because you didn't even make us pay for the shipping and it's way cheaper than the store itself and then go get it",
                "rating": 3
            },
            {
                "title": "Wrong item",
                "text": "I received the wrong article. They don't solve me, it just gives me the option to take the item to an email and print a label at my house. That's why I buy online and because of your mistake I have to leave.",
                "rating": 1
            },
            {
                "title": "Old goods...",
                "text": "no address or stamp, stain on spine.   \nold stuff\nno own bag\ncrumple",
                "rating": 1
            },
            {
                "title": "I did not receive my full order.",
                "text": "I did not receive my whole order. I ordered one 2x and two large shirts, but they only sent one 2x and one large. I tried to let them know, but the only way to reach out is to request a refund and the only way to do that is to send an item back. How do you send and item back if you don't have it. Very disappointed. I purchased the shirts for my boys to wear for Easter Sunday and now I have to figure something else out.",
                "rating": 1
            },
            {
                "title": "Priced perfect",
                "text": "This shirt is great for the price. It' is  true to size . It is 100% cotton. I purchased a black and white one. Theirs nothing to dislike. The price is just right",
                "rating": 5
            },
            {
                "title": "Classy!",
                "text": "Bought this for my boyfriends birthday! He's 6'5, 190 lbs and wears a Large. The shirt is great quality and the feels awesome! Not to mention he looks great in it too.",
                "rating": 5
            },
            {
                "title": "Kind of disappointed but I am picky.",
                "text": "This shirt is not horrible.  I was disappointed with the quality.  Looked like neck was stretched out.  And some may call me crazy but it wasn't the bright white shirt I was looking for.  Gave it 4 stars because it's not a horrible purchase.    But Main reason…..it is\nNot for me.",
                "rating": 4
            },
            {
                "title": "Polo from Wal-Mart at Wal-Mart prices. WOW !!!",
                "text": "Okay it is just a T shirt. The logo and the fit takes it from a \"hey honey I'm going to mow the yard\" to \"hey babe lets go out for steak\" type of shirt. Casual, neat and comfortable. Also the shirt runs true to size. Something that's kind of hit and miss for me.",
                "rating": 5
            },
            {
                "title": "Not 100% Cotton",
                "text": "Disappointed to find that this t shirt is not 100% cotton as advertised. That's why I gave it a 4 star review. Though this shirt is softer than most other polyester cotton blend T-shirts. It Definitely is Not 100% cotton . It is well made and fits true to size. And would still recommend this shirt but know that it is Polyester cotton.",
                "rating": 4
            },
            {
                "text": "Fits well, not the most fitted shirt but definitely better quality than most shirts you will find in this price range.",
                "rating": 5
            },
            {
                "title": "Not true to size",
                "text": "First thing it is coming very fast which is a plus point. My only issue is that it is much smaller than the size I ordered which means not true to size. Besides this, it is a good shirt.",
                "rating": 2
            },
            {
                "text": "The price was better than other retailer's. Shipping was very fast. The quality of the product is very nice.",
                "rating": 5
            },
            {
                "text": "Very nice well made shirt at a fraction of the price of some shirts I wear!! Will recommend and buy again!!",
                "rating": 5
            },
            {
                "title": "Price satisfied",
                "text": "This shirt is great for the price it's 100% cotton, they may shrink a bit. It is light weight and the color is solid.",
                "rating": 5
            }
        ]
    },
    "9": {
        "product_id": "803538514",
        "reviews": [
            {
                "title": "😁 BBQing",
                "text": "Well to start off follow directions, I tried to be a man an not. So ended up taking few parts back off an had to out back together. 😔 I think for the price its a win. We cooked enough food on it for 15 people as soon as we got it. Burgers, hotdogs, chicken, sausage, and some steaks. Its small but grill is enough to cook decent amount on. I got this for my husband and thought oh man is this gonna be a dud. Well surprise it wasnt. He loved it an couldnt believe only paid couple bucks shy of a 💯. Grant you its not like the big silver grills you ory are used to seeing, but i like it. compact enough and lightweight. We've had it on the back porch and front. Now I know we couldnt of done that with the bigger grills. Also even fully assembled can fit into the back of my vehicle. I have Jeep liberty if that helps with the sizing of it. So if we want to take to his parents or even camping so be it. So if ya want something small thats not going to take up limited space on your porch this is it. You can do everything on it that you can do on a bigger grill. we had on it at the same time 12 burgers 8 sausages and set a whole package of dogs on it. So If you need to grill more than that at a time maybe its not the grill for you. But for my family of four its a win. Plus I'm not heating up my kitchen an get to enjoy my husband to cook on it. When they say looks are deceiving well its true with this. Looks like something small an flimsy but very sturdy. I like the hooks to keep the utensils on and the sides you can put your platters on and it stays. So I guess win for me. I know they say bigger is better but not in this case. I'm happy with the purchase and glad I followed through an got it. We have been cooking on it a lot. It doesnt come with a tank so I had one an went an got it filled. So if you have one it cost me like 15 bucks to get it filled. So thats the only thing extra I had get. But I see tanks all over now at gas stations not sure how much. Oh when we hooked it up I thought wed have to light it because of the chain thats with it. But no you turn the knobs and it clicks an starts. So thats another good thing. Hope this helps with your decision on buying. Hope you enjoy the grill an get to bbq and enjoy. Dont mind the mess we've been outside an grillin a lot since I purchased this. 😁✌️",
                "rating": 5
            },
            {
                "title": "Engulfed in Flames after 1-Month",
                "text": "Bought 05/21/24 Engulfed on fire 06/04/24.  The regulator that comes preinstalled from the manufacturer to the gas line totally melted and engulfed the entire grill in flames.  I see some previous reviews of the same problem.  SAFETY CONCERN!!!! This items should be recalled!!",
                "rating": 1
            },
            {
                "title": "Happy family",
                "text": "Bought this for my son a week ago. He says that it was an easy and quick assembly, all parts were in the box.  He's been using it most days for a quick and delicious meal with a no fuss clean up.",
                "rating": 5
            },
            {
                "title": "😁 BBQing",
                "text": "Well to start off follow directions, I tried to be a man an not. So ended up taking few parts back off an had to out back together. 😔 I think for the price its a win. We cooked enough food on it for 15 people as soon as we got it. Burgers, hotdogs, chicken, sausage, and some steaks. Its small but grill is enough to cook decent amount on. I got this for my husband and thought oh man is this gonna be a dud. Well surprise it wasnt. He loved it an couldnt believe only paid couple bucks shy of a 💯. Grant you its not like the big silver grills you ory are used to seeing, but i like it. compact enough and lightweight. We've had it on the back porch and front. Now I know we couldnt of done that with the bigger grills. Also even fully assembled can fit into the back of my vehicle. I have Jeep liberty if that helps with the sizing of it. So if we want to take to his parents or even camping so be it. So if ya want something small thats not going to take up limited space on your porch this is it. You can do everything on it that you can do on a bigger grill. we had on it at the same time 12 burgers 8 sausages and set a whole package of dogs on it. So If you need to grill more than that at a time maybe its not the grill for you. But for my family of four its a win. Plus I'm not heating up my kitchen an get to enjoy my husband to cook on it. When they say looks are deceiving well its true with this. Looks like something small an flimsy but very sturdy. I like the hooks to keep the utensils on and the sides you can put your platters on and it stays. So I guess win for me. I know they say bigger is better but not in this case. I'm happy with the purchase and glad I followed through an got it. We have been cooking on it a lot. It doesnt come with a tank so I had one an went an got it filled. So if you have one it cost me like 15 bucks to get it filled. So thats the only thing extra I had get. But I see tanks all over now at gas stations not sure how much. Oh when we hooked it up I thought wed have to light it because of the chain thats with it. But no you turn the knobs and it clicks an starts. So thats another good thing. Hope this helps with your decision on buying. Hope you enjoy the grill an get to bbq and enjoy. Dont mind the mess we've been outside an grillin a lot since I purchased this. 😁✌️",
                "rating": 5
            },
            {
                "title": "Nice grill at a nice price!",
                "text": "When I assembled this grill, I was impressed with how good all the parts lined up and fit together. From the careful packaging to the well thought out instructions, this manufacturer seems to make quality a top priority. I've only used the grill once so far but was very happy with the results. It cooked evenly and the food turned out great!",
                "rating": 5
            },
            {
                "title": "Grill Expert",
                "text": "The is a great grill for a small or normal size family. Very simple to put together without the instructions. The instructions provided weren't very useful at all and that could be an issue for some. The screws for the drip pan holder don't fit properly on the grill. Something they really should fix..",
                "rating": 4
            },
            {
                "title": "My First Grill",
                "text": "This is my first grill so I started small.\nIt's easy to cook on but was a little challenging to put together.",
                "rating": 4
            },
            {
                "title": "Nice entry level grill",
                "text": "This is not too hard to put together, I got stick at a couple of steps, but it took about an hour to put together. It ends up being a pretty rigid grill in frame but the top rack falls often, and collapsed on me while grilling, which kind of wasn't a surprise. The propane tank doesn't seat as it should on the rail, but also hasn't been an issue. This cooked everything up pretty nicely, I think for a little bit more I could have gotten something better but this is also pretty decent.",
                "rating": 3
            },
            {
                "title": "Grill",
                "text": "When I received the grill some of the black coat was damaged On the grill, It was a little difficult to put together.\nDue to 1 stupid screw, my advice is..put the screws in where the heat reflector is first and then screw in the other side otherwise you'll have to take it apart and redo it.",
                "rating": 3
            },
            {
                "title": "Engulfed in Flames after 1-Month",
                "text": "Bought 05/21/24 Engulfed on fire 06/04/24.  The regulator that comes preinstalled from the manufacturer to the gas line totally melted and engulfed the entire grill in flames.  I see some previous reviews of the same problem.  SAFETY CONCERN!!!! This items should be recalled!!",
                "rating": 1
            },
            {
                "title": "very flimsey and falls apart easily.",
                "text": "Grill keep falling apart.  The screws hold the horizontal pieces are stripped and not longer holds the grill together.   We've only grilled a few times.  We are no longer using due to the fact that we think it's a safety issue while the grill is lit and turned on.",
                "rating": 1
            },
            {
                "title": "It literally caused a fire on its first use.",
                "text": "It was difficult to assemble, but I figured since it was so cheap, it was worth a little hassle. However, on its maiden voyage for Memorial Day, it literally caught fire due to a faulty gas line. The part to fix it was $47, which defeated the purpose of a cheap grill. Do yourself a favor and spend a few more bucks or you, too, could have ruined family holidays!!!",
                "rating": 1
            },
            {
                "title": "Great buy",
                "text": "Directions were awesome… no words just great pictures. Went together like I hoped it would. Perfect for me snd my wife! Grilled chicken breasts- delicioso!! Why did I keep my old one for so long?",
                "rating": 5
            },
            {
                "title": "Excellent",
                "text": "Great quality. Built by the popular Home Depot brand Nexgrill. Easy and quick to assemble. As long as you clean your grates and burner covers a couple times a month this will last you a good while. Can't beat it for the price.",
                "rating": 5
            },
            {
                "title": "Cheap and flimsy",
                "text": "First 30 min on the grill and the upper rack is eating and not staying together. Basically sitting on the first rack. Don't waste your money. Spend a few bucks more for better",
                "rating": 1
            },
            {
                "title": "Decent grill, good value",
                "text": "This is the 3rd or 4th one we've purchased for different properties. It's inexpensive and easy to use. Decent grill and so far they are all lasted. As our other grills have been rotated out of service, THIS is the grill I'm going with. Some sit in the sun and weather and some under a porch, but all have done well so far.",
                "rating": 5
            },
            {
                "title": "Love it",
                "text": "This exceeded my expectations! I don't know how well it will hold up over time compared to a better quality grill, but it does great for a beginner on a grill. \n\nI will say that typically I put everything together on my own, but this was a little tricky at parts with what I felt like was vagueness in the instructions provided - it probably took me about 1.5 hours by myself.",
                "rating": 5
            },
            {
                "title": "Great buy!",
                "text": "Took about an hour to put together, you need a phillips head and an adjustable wrench or pliers. Pictures [there are no word instructions.]  I have used it almost every night for a week to avoid heating up my living space. I absolutely love it! Great little grill, especially for the price.",
                "rating": 5
            },
            {
                "title": "Mess on floor, Holes in the grill, no base cover",
                "text": "There's holes on the bottom base inside where the meat gets cooked and there's a small tray in the middle under that, that catches the juices that fall? But juice still escapes and makes it's way through the holes on the sides and theres no bottom base either on the level of the wheels. So just grease stains on the floor is what you'll get. Other than that it really is perfect. 🥲",
                "rating": 3
            },
            {
                "title": "Crap grill not worth half of what I paid",
                "text": "Couldn't be put together correctly, parts were damaged. Poorly made cheap plastic knobs are loose and wonky. Returning it and getting something better.",
                "rating": 1
            },
            {
                "title": "Nice grill",
                "text": "Easy to put together, a bit time consuming but I did it when I was sick cus I don't sit down ever. Haven't used it yet but overall very nice for the price. Comes with the propane hose already. Just need the propane tank and you're set.",
                "rating": 5
            },
            {
                "title": "0",
                "text": "The BBQ arrived damaged and rusty, once I finished assembling it I looked closely and it had several damaged and rusty areas... Not very good since the BBQ was damaged at the factory. The box arrived in excellent condition and was well wrapped. But once I put it together and took a good look at the areas, many areas are damaged.",
                "rating": 1
            }
        ]
    },
    "10": {
        "product_id": "2718971137",
        "reviews": [
            {
                "title": "Sale Grill",
                "text": "Purchased a new grill online at a sale price.  It was delivered quickly. It was easy to put together after studying the directions and putting it together and then redoing it to get it right. One hour later I had my grill finished and grilled up some chicken breasts.  UMMM good.",
                "rating": 5
            },
            {
                "title": "Disappointed to say the least",
                "text": "Product came defective.  The ignition spark doesn't work.  I paid for setup only to find out the product does not work.  Now I either have to disassemble it to ship it back or get a replacement part that I have to install myself so anyway you look at it I am out 100 bucks for assembly.  Cannot comment on the product because it came defective but super disappointed with Walmart's procedure to return.",
                "rating": 1
            },
            {
                "title": "Delivery was prompt snd grill eorkd good",
                "text": "I would definely buy again",
                "rating": 5
            },
            {
                "title": "Sale Grill",
                "text": "Purchased a new grill online at a sale price.  It was delivered quickly. It was easy to put together after studying the directions and putting it together and then redoing it to get it right. One hour later I had my grill finished and grilled up some chicken breasts.  UMMM good.",
                "rating": 5
            },
            {
                "title": "The big surprise!",
                "text": "The delivery was rather a surprise. I did not know of any text I missed. However since I have Parkinsonism, I had to have my handyman put it together. He understood the directions, and quickly constructed the grill.\n    The big box was empty. He connected a container of gas. He then christened the grill with steaks for us and them. Steaks were great. I will have a good summer using my new grill.",
                "rating": 5
            },
            {
                "title": "Great grill",
                "text": "Once assembled this grill works great!  Assembly was a bit complicated but it grills great burgers!",
                "rating": 4
            },
            {
                "title": "A little disappointed.",
                "text": "I bought this after trying to find a replacement for my 3 burner infrared unit. Reading through what was available, this appeared to be the one. A little disappointed with all of the flare ups from the somewhat open burner concept.",
                "rating": 3
            },
            {
                "title": "Time consuming",
                "text": "Hard to put together. Missing are the clips that holds the charbroil sign on grill. Appears the pins that hold it on are broken and signia just falls off need new one and clips to hold it on. Tried submitting photo but couldn't",
                "rating": 3
            },
            {
                "title": "Good barbecue but grates are hard to clean",
                "text": "It's good for value but the grates are hard to clean and the brush they give you melted right away I'm going to replace the grates hopefully",
                "rating": 3
            },
            {
                "title": "Love it but a few quirks",
                "text": "The grill cooks much hotter than previous grills I've owned.  I have to keep the grill on low and even then the temperature stays around 400 degrees.  It does heat very quickly.  Also, there is propane escaping even with all of the controls turned off. The only way to stop the propane from leaking is to turn it off at the bottle after each use.  Otherwise, I like the grill.",
                "rating": 3
            },
            {
                "title": "Disappointed to say the least",
                "text": "Product came defective.  The ignition spark doesn't work.  I paid for setup only to find out the product does not work.  Now I either have to disassemble it to ship it back or get a replacement part that I have to install myself so anyway you look at it I am out 100 bucks for assembly.  Cannot comment on the product because it came defective but super disappointed with Walmart's procedure to return.",
                "rating": 1
            },
            {
                "text": "The product was missing the wheels and the grates. The packeage has been sent to someone prior to me. Retaped and looks like the box was air dropped from a plane. I need to get a new one or a refund thank you.",
                "rating": 1
            },
            {
                "title": "Grill",
                "text": "Fairly straightforward to assemble. Drip pan slightly challenging to install. Grill cooks well so far.",
                "rating": 4
            },
            {
                "title": "Love this grill!",
                "text": "Love this grill, the ease of cooking and repeatability!  Even heat that makes grilling a delight.  Never burnt, unless I try to and easy to clean.  This is my 3rd and for the $, you can’t beat it.",
                "rating": 5
            },
            {
                "text": "Great grill! The assembly instructions included are terrible. If not for customer service suggesting we view the instructions online and then enlarge the photos, we would have returned the grill. We also had to use YouTube!",
                "rating": 5
            },
            {
                "title": "Even cooking",
                "text": "Bought it month ago. Hard to assemble but I am very happy.",
                "rating": 5
            },
            {
                "title": "Great Product",
                "text": "I like it that it does not flame up and burn the food, heat is distribution evenly.",
                "rating": 5
            },
            {
                "title": "Poor quality",
                "text": "Everything is so flimsy and  so cheaply made. Very disappointing.",
                "rating": 2
            },
            {
                "title": "Difficult to Move, Grates Difficult to Clean",
                "text": "The fact that there are only wheels on one side makes the grill difficult to move, especially in a small space.  Also, food builds up in the grooves and there is no way to scrape it off into some reserve or the bottom of the grill.  (It says that using the clean mode turns food into ash, but I have not found that to be the case.) You have to either remove the grates & clean them or I use an ash vacuum to suck up the crumbs.",
                "rating": 3
            },
            {
                "title": "Cooks fine. Ease of cleaning is a nightmare.",
                "text": "I have the TRU-infared grates on my grill. The grill cooks food well.......but the cleanup afterwards is infuriating. It is very difficult to get the bristles on any brush (wire or nylon) deep enough into the valleys of the grates to brush away greasy gunk that builds up. I cleaned with a brush after every use and still it builds up in the valleys. This makes the grill not function properly. I love to grill, I don't mind cleaning, but cleaning the grates ruin all the fun.",
                "rating": 1
            },
            {
                "title": "Tin can!",
                "text": "Disappointed! Compared to the last gas grill I purchased this is a piece of crap that probably won’t hold up to the elements. Campbells uses thicker metal for their soup cans!!!!",
                "rating": 1
            },
            {
                "title": "The worst grates design imaginable",
                "text": "Just received this as a gift. Sadly, this may be the worst grill I've ever used. I've never seen grates accumulate so much debris after just one cook. Very difficult to clean the porcelin grates to the point I might just give it away and buy something different.additionally thr ignitor button does does not work on this new product.",
                "rating": 1
            }
        ]
    },
    "11": {
        "product_id": "456281606",
        "reviews": [
            {
                "title": "Queen Grilling",
                "text": "i had to put this grill together myself and the instructions is easy and understanding. after you put it together it looks so nice. I have been grilling every weekend with it. great buy.",
                "rating": 5
            },
            {
                "title": "Arrives damaged and customer service is no help",
                "text": "I ordered it to use this weekend. It arrived Friday and it was clear there was scratches which was fine but as I was already 50 % done the lid wouldn't line up at all. I tried several times to align it better but nothing the lid is damaged. Customer service was useless in helping me solve the problem. Now i don't have a grill to use this weekend.",
                "rating": 1
            },
            {
                "title": "Queen Grilling",
                "text": "i had to put this grill together myself and the instructions is easy and understanding. after you put it together it looks so nice. I have been grilling every weekend with it. great buy.",
                "rating": 5
            },
            {
                "title": "It's not bad!",
                "text": "For $120, it's not a bad grill. It does what need it to do. It feels on the cheap side but I'm ok with it. I've barbecue multiple times and I'm very satisfied!",
                "rating": 5
            },
            {
                "title": "Love it",
                "text": "Surprised my husband with this grill. He loved it. I put it together myself. Had some tough moments that needed 2 sets of hands but other than that things flowed smooth. He's been using it weekly since his gift in March. Great purchase and great price.",
                "rating": 5
            },
            {
                "title": "Easy assembly",
                "text": "Easy to follow setup instructions very good for the price.",
                "rating": 5
            },
            {
                "title": "looks beautiful",
                "text": "I just put this together the other day. It actually went smooth, putting it together. Reading the directions. They only parked that confused me was the warmer grate That connects to the lid. I had to YouTube it to see how that was put together, but the rest of the grilled was east to put together",
                "rating": 5
            },
            {
                "title": "Excelent",
                "text": "Pretty good and the price even better I make some excellent smoked and everything is delicious, the material is a little thin but for the price it is perfect, delighted with this purchase",
                "rating": 5
            },
            {
                "title": "Love it!",
                "text": "Grill as pictured. No issues or complaints. Nice grill for the value!",
                "rating": 5
            },
            {
                "title": "Great Grill",
                "text": "It was easy to put together as long as you read the directions and remember to not tighten all the screws until you finish with the section. I made sure to season my grill with Pam spray so the paint wouldn't bubble and peel. I made sure to let the coals white over before closing the lid... to prevent it from over heating. It worked great... everything I wanted in a charcoal grill! I had the hardest time making the decision to purchase due to mixed reviews. But I kept telling myself some ppl just don't follow directions well and I believed in my abilities to figure out a solution to each negative review. Please purchase the grill if you are interested because you'd be glad that you did. And YouTube the reservations you may have it's plenty of videos to help you through.",
                "rating": 5
            },
            {
                "title": "Amazing buy",
                "text": "I would give this more than five stars if possible. I love this grill! It's super easy to put together. The two tables and tool rack are so convenient. I also love that the charcoal tray is adjustable so you can change how close your food is to the coals. There's the charcoal tray and then a tray to catch the burned pieces so that they don't lay on the bottom of the grill. \nI haven't used the smoker yet, but I'm excited to.",
                "rating": 5
            },
            {
                "title": "this barbeque grill is simple fabulous...",
                "text": "the looks are absolutely beautiful..\nafter having someone put grill together.the grill looks better in person\n\ni love it ❤️ a",
                "rating": 5
            },
            {
                "title": "charcoal grill With offset smoker",
                "text": "Affordable charcoal grill with offset smoker.\nMy husband loves it! 💕",
                "rating": 5
            },
            {
                "title": "Does the job",
                "text": "I researched many charcoal grills with different price points and this grill that the bill.  I am happy with this purchase.",
                "rating": 5
            },
            {
                "title": "Amazing",
                "text": "My wife loved it once she saw it on camera she didn't know I got her this as a surprise .. she then built it and made a bbq",
                "rating": 5
            },
            {
                "title": "Get your 6 pack out and get to work.",
                "text": "Great for the price. Took a couple hours and a few beers to put together. The instructions are okay but a little more detail would of helped. All around its a great purchase.",
                "rating": 5
            },
            {
                "title": "Cheap descent grill",
                "text": "Definitely a decent grill for the money. People in the reviews complaining about the lid melting off @ 600 degrees......why was your grill EVER near 600 degrees? If you're handy with tools, understand how to build things with basic instructions and have any sort of clue about how to actually grill with charcoal....get it and appreciate the cheap grill for what it is. Also, If you can't straighten a dent out or just dont want to...dont take the chance and trust the mail....buy it in the store and pick it up yourself. Mine was delivered flawless though.",
                "rating": 4
            },
            {
                "title": "Best bang for the buck.",
                "text": "For the money this unit cannot be beat. Assembly was simple, did it myself in about an hour. The unit can be used in a number of different ways, direct heat, indirect with the smoker box, sear in smoke box, grill direct in main compartment, etc. Made me wonder why anyone would pay upwards to a thousand dollars when this does the job nicely. No complaints about quality or construction, no reason to have it be any heavier. Rolls around the deck easily. All holes lined up, shelves are sturdy, convenient hooks for accessories. I am here to order another one if that tells you anything.",
                "rating": 5
            },
            {
                "title": "Great but screws loosened easily",
                "text": "The grill is huge, it's definitely a smoker, but like some of the other reviews the handle came off the same day I put it together and used the grill. Other than that it appears to be fine. I can't fully speak on the sturdiness just yet since it only been a few days and already I'm battling with the handle and came with a small scratch.",
                "rating": 4
            },
            {
                "title": "Not reliable paint.",
                "text": "This grill changed color during our first cookout of this year and I was embarrassed when my guests arrived. The description stated that the color will not change and it's made of new material to keep its rich color. The grill is spacious and I bought accessories for this thang, just upset of what the company promised, but the expectations were not met. I need to contact Walmart or the company…",
                "rating": 2
            },
            {
                "title": "this father's day gift was a hit!",
                "text": "so my husband has been wanting a new grill forever. he had the last one for a few years. and it was still great but losing color. he's been wanting one with a smoker and I found this one and it was SUPER cheap. all the others were $300. so I got this for an early Father's day gift and put it together for him while he was at work. and he loves it. all the table space on it is amazing. it's so much better than utensils and plates piled on one side table like with his old ones. this one actually has utensil hooks. 3 of them. and the long front table is great for setting plates there to get out food. and now the side table isn't even used lol. it's soo roomy. his old one was big enough for one pack of meat ( like 5 chicken breasts) and boxed in so utensils were hard to use. but this one opens all the way and no sides when open so it's very easy to get in there and do what's needed very easily. it has a top warming rack and a bottom adjustable hight cooking rack. super cool. it has a charcoal tray with handles for easy removal. the smoker is seperate and holds about a pack of meat and air flow to the big grill if you wanna use all of it at once. the big grill held 3 different packs of meat and still had room for 2 more. smoker also has a removable wood chip tray with no handles. took 2 hours to put together. but I also had kids to stop and tend to alot or it would have took maybe an hour and 15 minutes. the only flaw was the smoker side door. the pre drilled holes didn't line up right and the door actually closed half way over the screw that latches it and the latch was about a half inch past the half covered screw. but luckily my husband had extra nuts an bolts laying around and was able to use his drill and fix it correctly. and trust me, I had the door in the right holes. directions were clear and easy. not hard at all to put together. it was a fantastic purchase. it's huge. the pictures do it no justice. it's very sleek and modern looking. we both love it. especially him. and when time for a new one, we'll probably just rebuy this one. it's freaking awesome.",
                "rating": 4
            },
            {
                "text": "Please wipe down your grill before using because my caught on fire on one side of the grill smh I'm so mad but in the instruction book it says they put some type of protecter for the grill and u have to wipe down before use. But other than that I like the grill",
                "rating": 2
            }
        ]
    },
    "12": {
        "product_id": "325293929",
        "reviews": [
            {
                "title": "Happy with my new refrigerator!",
                "text": "I love my refrigerator it fits perfectly in my bedroom! I had a refrigerator before but it wasn’t this nice it had one door and a little flip door for a small freezer that didn’t have any space! This new refrigerator has two doors, nice size freezer, two drawers in the bottom of the refrigerator, a a door compartment for storage space!☺️",
                "rating": 5
            },
            {
                "text": "This was my second attempt to order a small fridge.  The first one was delivered about 200 miles away.  Walmart did reimburse, and give me a $25 credit, but I still had to start the process again.  Also, the fridge wasn't even eligible for the $25!   I ordered this one, and it came damaged.  The freezer door is quite dented, it is still functional though.  I started a chat and was transferred to 3 different people.  No one asked how they could correct the situation, just wanted to start the return process.  This is a large item and returning is difficult.  I simply wanted to make you guys aware and possible get some credit.  Not to mention I placed 2 orders, with 3-5 items in each order, and received each item individually on different days!  Ever consider consolidating to save resources and energy??  No worries, I already cancelled my membership.",
                "rating": 1
            },
            {
                "title": "Happy with my new refrigerator!",
                "text": "I love my refrigerator it fits perfectly in my bedroom! I had a refrigerator before but it wasn’t this nice it had one door and a little flip door for a small freezer that didn’t have any space! This new refrigerator has two doors, nice size freezer, two drawers in the bottom of the refrigerator, a a door compartment for storage space!☺️",
                "rating": 5
            },
            {
                "title": "Great buy!",
                "text": "There is so much room in the freezer! I am using this for my office so I was concerned about the ability to store frozen food for lunches. It is about half the size of my home freezer. The fridge also has a lot of room and the ability to remove the trays to make room for taller items is great!",
                "rating": 5
            },
            {
                "title": "I Love This Mini Fridge!",
                "text": "I love everything about this fridge- the freezer part on top is roomy %26 works well. The fridge part has two shelves, plus a small drawer under the bottom shelf. I had surgery %26 have not been able to walk on both feet, so this fridge in my bedroom has kept me fed with healthy foods while I have been recuperating.",
                "rating": 5
            },
            {
                "title": "A must buy!",
                "text": "My mini fridge just arrived today and so far I like what I see! It has enough storage space and that’s a plus for me being that my original fridge been out some time now and I  didn’t have anywhere to place my meat. No scratches and as soon as I plugged the fridge up it started to get cold. I would highly recommend getting this mini fridge! Trust me you will not be disappointed. And another great thing.. it came with a mini ice tray and scooper.",
                "rating": 5
            },
            {
                "title": "good for the price.",
                "text": "good little fridge for the price. it has a small fridge area, regular mustard dressing etc wont fit upright anywhere. it does have a spot for a 2L and holds drink cans well. i fashioned corkboard under mine for i have polished concrete floors, its fairly quiet, i do have it in my room.",
                "rating": 4
            },
            {
                "title": "Received damaged but I still love it",
                "text": "I received my package two days after I ordered it and the box had one vertical crease in it but otherwise it looked fine but when we opened the box the fridge door has 3 dents in it so I can’t tell if it was packaged like that or happened during transit, but it’s just like a real fridge and is big enough to hold a quite a bit of items and compact enough to have in a bedroom without taking too much space and the price was very reasonable I just wish it was not dented , returning products is inconvenient so I’ll just deal with it, other than the dents it’s perfect",
                "rating": 3
            },
            {
                "title": "Used Fridge",
                "text": "1. Fridge was received with no bottom on the box, so when I pulled up, it jusg came right off over the fridge (which was helpful but concerning regarding transit. \n\n2. there are scratches and fading paint and bubbles \n\n3. inside was dirty \n\n4. Cord was stuff in between some coils and was difficult to get out without bending some of the coil pieces. \n\n5. No setup manual, just a small manual about how to care for the fridge and change the sides the door opens on.",
                "rating": 2
            },
            {
                "text": "This was my second attempt to order a small fridge.  The first one was delivered about 200 miles away.  Walmart did reimburse, and give me a $25 credit, but I still had to start the process again.  Also, the fridge wasn't even eligible for the $25!   I ordered this one, and it came damaged.  The freezer door is quite dented, it is still functional though.  I started a chat and was transferred to 3 different people.  No one asked how they could correct the situation, just wanted to start the return process.  This is a large item and returning is difficult.  I simply wanted to make you guys aware and possible get some credit.  Not to mention I placed 2 orders, with 3-5 items in each order, and received each item individually on different days!  Ever consider consolidating to save resources and energy??  No worries, I already cancelled my membership.",
                "rating": 1
            },
            {
                "title": "Drop kicked ?",
                "text": "I knew as soon as I saw the box on my porch, that the outcome wasnt going to be good. The fridge is nice, however, who ever delivered or packed this up must have drop kicked it. disappointing to say the least. This was a gift for my husband for his work. Lesson learned wont order anything to be delivered again",
                "rating": 1
            },
            {
                "title": "Bad customer service and defect product",
                "text": "My order arrived with the box tore and missing the bottom piece. When I opened it there was a dent on the front door and the door wouldn't stay shut! I immediately returned it upon realizing it was a defect yet today when i got home from work it was back on my doorstep. What exactly am i supposed to do with this fridge now?",
                "rating": 1
            },
            {
                "title": "So far so good.",
                "text": "This mini fridge is great so far! It's pretty quiet until the compressor is running, but that is to be expected. There's plenty of space in both compartments and it keeps everything nice and cold. I appreciated the detailed instructions on how to maintain my fridge and the scraper for the ice droplets that accumulate which is minimal for mine. I like the mini ice tray, but I don't really use it. It's still a nice addition to having this fridge. Overall I'm satisfied with my purchase.",
                "rating": 5
            },
            {
                "title": "Legendary Refrigerator",
                "text": "i like that the fridge is literally like a small fridge, it's separated from freezer to fridge and it works very well. it has just enough space for everything you need..",
                "rating": 5
            },
            {
                "title": "Great product",
                "text": "My shopping experience was good. I hoped I could find this fridge in a nearby Walmart, but not this time, so I ordered online. It seems that every 2 years they have a great selection but the year everyone wants one is the off year. I am satisfied with the product and happy with the speedy delivery. The freezer holds a great variety of frozen foods and freezes like the Artic. We had Hot Pockets, pancake/sausage on a stick, several breakfast bowls, a bag of chicken wings, and a few more items, these were opened full-sized boxes. There is room for all the regular refrigerator foods and many bottles and cans of liquids.  We plugged it up with a surge protector, of course.  I hope this little bugger lasts a very long time.  The other one I had, very much like this one, did.",
                "rating": 5
            },
            {
                "title": "Great for any bedroom or dorm room!",
                "text": "Perfect little fridge for my bedroom! It stores all of my little drinks and snacks well as well as my bunnies vegetables. It is all kept cool and you can even control the temperature inside as well. I love the fact that there is a separate freezer as well!",
                "rating": 5
            },
            {
                "title": "Fridge struggles to stay below 40 degrees at MAX!",
                "text": "I originally bought this with intention to store products like yogurt and deli meat in it to alleviate space in the main fridge that I share with roommates. The fridge struggles to stay below 40 degrees set at nearly max temperature (temperatures any higher will result in meat/dairy spoilages). This product has been shipped to my address (I live in a Mid-rise building) due to the fact that this wouldn't fit in my car. I'm greatly disappointed and feel stuck with a appliance that doesn't serve really any purpose other than what I originally intended to bought it for. I own a 2nd mini fridge that is the Igloo 3.2 Cubic and that thing easily sits at 35 degrees set not even 3 quarters of the way to max. I should of just bought a 2nd igloo mini fridge. Probably will end up returning this product somehow if seller does not provide solutions to my issue that don't involve me going way out of my way.",
                "rating": 1
            },
            {
                "title": "Best mini fridge freezer EVER",
                "text": "I did a lot of shopping before I made this purchase. And a lot of disappointment at bigger stores like Lowe’s in Home Depot. Best bang for the buck and I didn’t even have to go in the store. I ordered it online and two people carried it out and put it in the backseat of my car.  and I love the fact that there’s no wasted space for cans. I’m able to put jars in the areas some people might put their soda or beer.",
                "rating": 5
            },
            {
                "text": "The delivery service is atrocious, once I received the product, I noticed several shards all in the refrigerator, to my surprise, they broke one of the glass shelves due to the mishandling of the product during delivery, and this is something that should not happen ever",
                "rating": 1
            },
            {
                "title": "It is a good freezer, but not refrigerator",
                "text": "I enjoyed it for the couple first days, but then noticed that the back of it was full of ice. Anything that I would place in the middle of the refrigerator, everything in the back would freeze. Half of my eggs would be frozen half of my drinks would be frozen, but the freezer works really well.",
                "rating": 1
            },
            {
                "title": "Great value for the low price.",
                "text": "I love my Arctic King 3.2 Cu ft two door mini fridge. I’m using it in my bedroom and it fits perfectly in the space I have for it. The freezer is a nice size with a shelf on the door and inside the fridge with its two shelves, a bin for fruits and veggies, and spaces on the door that can hold a half gallon of milk or juice, six cans of soda gives me plenty of storage space. And, it’s energy efficient, only $38 per year.",
                "rating": 5
            },
            {
                "title": "Best on the market today!",
                "text": "In the last 3 months I’ve bought 3 “mini fridges” and either returned them or gave them away. This beautiful perfect in every way mini fridge is EXACTLY what a small refrigerator is supposed to be! The perfect size, exceptionally clean and well put together. I’m proud of this purchase and I will recommend it to everyone. The freezer is perfect  and it’s got a vegetable cubby. I love that it’s glass shelves instead of plastic. It’s really nice thank you guys.",
                "rating": 5
            }
        ]
    },
    "13": {
        "product_id": "647825096",
        "reviews": [
            {
                "title": "i love it!!!! it does the job",
                "text": "idk why i thought it'll be bigger but it'll have to do. it does its job so i can't complain at all. don't pay the pictures any mind the top is junky lol i have toddler that love messing with the food",
                "rating": 5
            },
            {
                "title": "Very Damaged Box and Item",
                "text": "I don't know if this refrigerator works or not because the box arrived very damaged. It was only held together on the bottom by the nylon strips.  The refrigerator was so dented upward and inward that the right back side could not be made level to the ground even with adjusting the feet. \nSee pictures. \nToo bad.",
                "rating": 1
            },
            {
                "title": "i love it!!!! it does the job",
                "text": "idk why i thought it'll be bigger but it'll have to do. it does its job so i can't complain at all. don't pay the pictures any mind the top is junky lol i have toddler that love messing with the food",
                "rating": 5
            },
            {
                "title": "damaged",
                "text": "it arrived today damaged - can I have an option to pick it up and replace it with a new item? it is too heavy for me to return by mail or return to walmart store;;",
                "rating": 3
            },
            {
                "title": "very disappointed that it had a dent in the side",
                "text": "Very nice gal delivered it, I hauled the box upstairs into the room I want it in , unboxed it - luckily the front was undamaged, however there is a  significant  dent in the side which I am very unhappy about. Not really interested in hauling it all the way back downstairs then to  the store, but do feel a gift card or something is appropriate as I was delivered damaged goods",
                "rating": 2
            },
            {
                "title": "Arrived Dented",
                "text": "It arrived on time which is a good thing but it came dented. I expect more from Walmart than to treat my things badly and to give me a damaged fridge.",
                "rating": 2
            },
            {
                "title": "Highly Upset",
                "text": "Strike on is the fact the delivery person put my refrigerator upside down and two is the fact my doors on the refrigerator is crooked and third is the fact it will not close. I’m highly upset because I move into my dorm next week and I do not know how to fix this unless I tape my tape it shut.",
                "rating": 1
            },
            {
                "title": "Damaged",
                "text": "My refrigerator was received out the box damaged. It is nice looking. The price in April 2021 was $114 to purchase and May 2021 the price to purchase $169. So, I never got to use it due it being damaged out of the box. I would have loved it otherwise.",
                "rating": 1
            },
            {
                "title": "Damaged",
                "text": "The refrigerator is nice and spacious. Buyers beware that the refrigerator came damaged when it arrived. Dented on the top left corner and dent on bottom left side. The box was not damaged so not sure how the actual refrigerator got damaged. This was a gift for my mom and it sucks that it was damaged.",
                "rating": 1
            },
            {
                "title": "Very Damaged Box and Item",
                "text": "I don't know if this refrigerator works or not because the box arrived very damaged. It was only held together on the bottom by the nylon strips.  The refrigerator was so dented upward and inward that the right back side could not be made level to the ground even with adjusting the feet. \nSee pictures. \nToo bad.",
                "rating": 1
            },
            {
                "title": "Disappointed",
                "text": "Pickup from the store was easy but when I got the refrigerator home, there was a problem. The door has a long crease in the metal looking door from the top to the bottom as seen in the picture below. Unfortunately I already had it up the stairs and in place before removing the packaging.  I am very disappointed.",
                "rating": 1
            },
            {
                "title": "Scratched up and dented",
                "text": "I received the refrigerator beaten up as if it was used. I didn't order a used refrigerator. I'm\nHoping it at least works because I'm writing this review as I'm opening the box. Highly disappointed",
                "rating": 1
            },
            {
                "title": "Bigger than expected, but arrived damaged.",
                "text": "This fridge is larger than I expected it to be. It did however, arrive damaged. There are dents on the side and on the door that are very noticeable. I haven't used it yet to see if those dents will affect the performance, but we shall see. Lots of fridge for the price. Photos attached.",
                "rating": 3
            },
            {
                "title": "Refund",
                "text": "The item says Delayed Delivery. Over 2 weeks no other communication. I searched the FedEx number and it said a tag has been made but hasn't been handed off to FedEx yet. I've asked 2 times for a refund. I was supposed to receive a response within 4 hrs. each time. No email. I want a refund.",
                "rating": 1
            },
            {
                "title": "Disappointed --only let me submit 2 photos",
                "text": "I bought this fridge online for store pickup for my school classroom.  I was excited about the price; however, when my husband picked it up the packaging was good though but it had a big dent on top of fridge. It also scratches of white paint on side and another dent on the opposite side.  I am very disappointed and I will probably be returning it. If it was up to me by the way it looks it looks used and was put in a new box.",
                "rating": 2
            },
            {
                "title": "I was worried mine would arrive damaged",
                "text": "First I must say I am very happy with the fridge itself.  Its nice having a freezer that actually freezes. And has room for 1/2 gallon of ice cream and several frozen dinners. Unlike most small 1 - 3  cubic foot refrigerators. The trade off is that the refrigerator compartment is about the size of a 1 cf mini fridge.\n\nAnd after reading several reviews stating that people had received damaged, scratched,",
                "rating": 4
            },
            {
                "title": "Very Good For It's Value",
                "text": "I would definitely recommend buying this fridge, especially if it's just for your bedroom and you want it for personal foods away from your family. It can hold small packaged meals and sodas, as well as up to a 2 Liter drink on the side. It also comes with a freezer for any ice cream or frozen foods that you might want. All in all a very good fridge and I recommend getting one for yourself!",
                "rating": 4
            },
            {
                "title": "Don't bother Walmart just call Galanz",
                "text": "mini fridge arrived damaged and with a bent frame. Contacted walmart and all they could offer was a return which would require me to rebox the product which I am unable to do or a refund which still required return of the product. However after calling Galanz they were quick to assess the situation and not only are providing me with a new shelf (which is out of stock due to covid understandably) and are having their support staff evaluate if it's safe to operate. My recommendation unless you have a truck capable of transporting the freezer is to contact Galanz direct as soon as you receive the fridge if it is damaged on delivery. while they have a year warranty you only have a month of full service warranty to claim damages done in shipping",
                "rating": 2
            },
            {
                "title": "10/10",
                "text": "It's perfect no dents work find for now but will see how it do in the future and it also came with an small ice tray and also if you going to buy one get an surge protector for it just for safety because I did because want to protect the outlet too at the same time",
                "rating": 5
            },
            {
                "title": "Disappointed with damages",
                "text": "Disappointed!  Received this mini frige today and it has a dent in each door :(. This was supposed to be for my daughter’s dorm room.  Who wants to pay full price for something damaged?  Looks like something could be done about better packing if so many of these arrive damaged to customers.",
                "rating": 1
            },
            {
                "title": "Damaged item, not satisfy with the purchase",
                "text": "Fridge was delivered with dent in the back. I read many comments and many of them have the same issue, damaged fridge as delivering. I wonder why walmart doesnt change the shipping service to improve it. The fridge works fine until now but I did not satisfy with the purchase.",
                "rating": 3
            },
            {
                "title": "Don't Know If Damage Has Affected Operation...",
                "text": "The refrigerator looks like it was slammed in one corner, dropped on that corner or something heavy was placed on that corner. Despite the fact that it was packed in Styrofoam boards and boxed with Styrofoam panels, it looks like it was dropped in one corner and there is crush damage. This is meant to be a Christmas present and I spent $200 on it. The least that could be done was deliver it in pristine condition.  I haven't turned it on yet so I don't know if the damage has affected operation. \n\nI'll be contacting Walmart.",
                "rating": 3
            }
        ]
    },
    "14": {
        "product_id": "2287982615",
        "reviews": [
            {
                "title": "Perfect!",
                "text": "i wasworried about there reviews but none of them were on the product but on shipping thru FedEx.    this wasn't an issue for me. fridge came in original fridgadare box covered and protected and packed with Styrofoam. My fedex shippers were awesome and even brought the fridge into my house. Imvery happy with buying a $500  fridge for $215. free shipping as well! Very happy!",
                "rating": 5
            },
            {
                "title": "DOA",
                "text": "Item came damaged, DOA. Item was delivered today, the box looks OK, no signs of damage, but when I opened it, i noticed there was oil leaking from the compressor (the padding carton board was soaked with oil and there were oil stains all over the compressor and the wires surrounding it). I set the fridge up and leave it there for a 6 hours, then tried plugging in the power but it doesn't work. The motor/compressor tried to start, but a few second later it makes some kind of knocking sounds, then the fridge shakes for 5, 6 seconds then everything stops. Then about a minute later, the whole cycle starts again and again...... I left it on like that for about 30 mins and the fridge's interior didn't get cool at all. Looks like its compressor is dead.",
                "rating": 1
            },
            {
                "title": "Perfect!",
                "text": "i wasworried about there reviews but none of them were on the product but on shipping thru FedEx.    this wasn't an issue for me. fridge came in original fridgadare box covered and protected and packed with Styrofoam. My fedex shippers were awesome and even brought the fridge into my house. Imvery happy with buying a $500  fridge for $215. free shipping as well! Very happy!",
                "rating": 5
            },
            {
                "title": "Great purchase!",
                "text": "This is a great little fridge.  I have only had it a couple weeks but it came in perfect shape with no issues.  Also, a great price to boot so I can't complain.   I was going to purchase later on but with this sale I couldn't resist.  It's been great to catch the overflow from the holidays that don't fit in the big fridge. I'm so happy with my purchase and it will come in super handy once graduation comes around.",
                "rating": 5
            },
            {
                "title": "17.5 Frigidaire   It  works great.",
                "text": "Will need ice trays for ice cubes.  Small but plenty of room for eggs bread. Meats. Milk. Has storage bin.   Door also has space to place items.   Not your normal size refrigerator but works just as well for back up or even for 1-2 people.  It is very nice aesthetically. I am 5'4 and it's taller then me to give you an idea.keeps things cold and frozen",
                "rating": 5
            },
            {
                "title": "Small Refrigerator/Freezer - No Complaints",
                "text": "Having problems with my basement beer fridge so decided to add a cheap small unit to supplement my needs. Appliance was packaged well, I fully expected damage upon arrival due to many of the customer reviews. Unit was unboxed and had adequate styrofoam packaging, no dents and scratch-free. Plugged in and after a night of running on temp control setting of 3.5 freezer is at 6.4F and fridge is 39.6F. There is a weird plastic cover on the compressor that Google tells me is to catch any possible condensation. Draws less than 2 amps of power when compressor is running. \n\nSo far I'm pleased with the price, performance and the rapid undamaged delivery.  Your experience may be different - good luck.",
                "rating": 5
            },
            {
                "title": "Fridge is perfect, delivery service may not be",
                "text": "So far this fridge has been perfect. Its a great dorm/studio/auxiliary fridge for 1-2 people.\nI have it in my room in this perfect spot that looks like it was made for it. I'm super happy I got it on sale for about $200 with 3 year warranty; knowing that these things full price were $550 with no warranty. I see many people put low star review ratings due to issues with fedex as the shipping company that deals with the frieght. I took the risk and it arrived in perfect condition with no dents or broken items inside the refrigerator. I recommend the item but I warn everyone that it is a lottery ordering one online and delivered to the home and out of walmarts control whether the fridge arrives in perfect condition or not. The only thing I dont like about the fridge is the bulb temperature color which is yellow as I prefer a crisp white but I won't reduce my rating over something I can easily replace myself. I live on the second floor and they put a bedframe outside my door but left the fridge at the bottom of the stairs lol again nothing against walmart and nothing against fedex. It is heavy and unsafe for someone to carry it up stairs by yourself. Its bulky and awkward to carry up by yourself. Also you must wait at least 24 hours before you plug into the wall as the fridge needs to be upright for that amount of time to have the refrigerant and compressor oils settle back down",
                "rating": 5
            },
            {
                "title": "World-Class Fridge",
                "text": "I bought this refrigerator for our small office,  in which five of us share the space over a couple of different shifts. \n\nThe thing looks great and works even better. It was an immediate hit with everyone, mainly because of its 7.5 cubic feet of interior space as well as the freezer portion. Lunches, drinks, various foodstuffs and even potluck-type items go into it with ease. \n\nI highly recommend this fridge if you're looking for something for a small studio or one-bedroom apartment or for an office where one of those small, boxy fridges that can barely hold a six-pack of soda pop is simply too small.",
                "rating": 5
            },
            {
                "title": "Buy it",
                "text": "This fridge is great I love it it was about 215 after taxes and shipping an 198 before taxes an shipping my package arrived on time an they left it at my door step in a presentable way my box was not all beat up and my fridge was not beat up or damaged my fridge doesn't leak it doesn't make loud noises through the night Best Buy ever my ice cream is froze it's better than my fridge that is in the kitchen",
                "rating": 5
            },
            {
                "title": "Buyer Beware",
                "text": "Similar to some other reviews, there is cosmetic damage. There is no where to leave info without filing a return, so I guess I'll leave a review. The top rear right-hand corner is smashed in. it was covered with a bracket for shipping and you could not see it from just looking at the box. The front of the fridge door has a deep dent in it directly front and center, and a crease in the stainless steel as if it were hit and then forcefully pushed. Again, couldn't tell from the box. I feel like these sat in the warehouse for quite some time as the plastic sticky wrap to protect it from scratches was nearly melded to the outside and very difficult to remove, which would explain the deep discount. our fridge went down and we needed something this size asap and this was the best deal with a 3 day wait time for delivery. After unboxing it and finding all this, with the return policy, I assume it is non returnable anyway. Glad we got it on sale at the very least. With the other reviews, I feel like these should be listed as scratch and dent. Anyway, just a heads up if you're considering it. Plugged it in, stated getting cold right away, so that is good.",
                "rating": 3
            },
            {
                "title": "Damaged Product",
                "text": "The product arrived damaged in two different places. I tried to contact Walmart and was only able to contact an automated service and all they wanted was to arrange a return. I'm not trying to go through that hassle. The product does work and function as it should it's just damaged and I'm not happy with it.",
                "rating": 2
            },
            {
                "title": "DOA",
                "text": "Item came damaged, DOA. Item was delivered today, the box looks OK, no signs of damage, but when I opened it, i noticed there was oil leaking from the compressor (the padding carton board was soaked with oil and there were oil stains all over the compressor and the wires surrounding it). I set the fridge up and leave it there for a 6 hours, then tried plugging in the power but it doesn't work. The motor/compressor tried to start, but a few second later it makes some kind of knocking sounds, then the fridge shakes for 5, 6 seconds then everything stops. Then about a minute later, the whole cycle starts again and again...... I left it on like that for about 30 mins and the fridge's interior didn't get cool at all. Looks like its compressor is dead.",
                "rating": 1
            },
            {
                "title": "Damaged and incorrectly delivered.",
                "text": "First, the item was incorrectly delivered four houses down. My address is posted on my mailbox, over the garage, and in large numbers near my front door - Impossible to miss yet they did. I had to drag the fridge all the way to my house. \n\nWhen I opened it, it had a large dent on the front of the fridge with the top corner completely smooshed. This was caused prior to me having to move it as it was upright when I opened it after getting it to my home. Extremely disappointing as I'm not going to order another and don't have a truck to return this one.",
                "rating": 2
            },
            {
                "title": "So far a good purchase",
                "text": "I had this refrigerator curbside picked up from Walmart on 1/26/24. It had the option to ship but I didn't want to chance it getting damaged. I even went inside the store prior to see if the box was damaged and luckily it wasn't. No damages or dents when I was installing it. I did notice that it was unleveled but we fixed it by turning the bottom legs on the fridge. I really love the way it looks and it works perfect for an office!",
                "rating": 5
            },
            {
                "title": "Damaged and garbage",
                "text": "The fridge came damaged and I kept it because they said I needed to repackage it to return it but the packaging was destroyed. I bought it in July and I opened it the other day to find that it completely quit working and all of our food is spoiled and I lost at least $100 worth of food. I am so disappointed. Walmart will do nothing for me. Merry Christmas, not!",
                "rating": 1
            },
            {
                "title": "Extra fridge",
                "text": "I love having the extra space when you come home from the grocery. \nI have had to play with the thermostat to keep My desired temp. And there was a small dent unfortunately right in the middle of the door. But it is lovely and wouldn't consider returning. Great price!",
                "rating": 5
            },
            {
                "title": "Perfect little fridge",
                "text": "The fridge was delivered in perfect condition and sealed properly so no damage was done. The fridge is a lot bigger than I expected which is a good thing because I needed a bigger fridge for my room. Right when I plugged it in it started cooling asap and I can finally fit and size drink , very satisfied with this purchase !!!",
                "rating": 5
            },
            {
                "title": "Cute Refrigerator",
                "text": "We purchased this Frigidaire refrigerator for my husband who is working away from home for a few months. It keeps food cold in both the refrigerator and the freezer. It is much larger than a dorm sized refrigerator. He is vey pleased with it.  Good purchase and reasonably priced!",
                "rating": 5
            },
            {
                "title": "If I could give zero I would",
                "text": "The reviews I read were indicating the item coming damaged but I thought no way mine would be that way Walmart wouldn't send me a damaged item, right? sure enough it came damaged. There was a hole in the box and when I looked in the metal was gauged out like whatever machine they used to pick it up impaled it. So I quickly asked to replace the item and after several incorrect pickup times by FedEx finally it was on its way back. After numerous calls to customer service this week indicating confusion with what was going on still no replacement. And today out of the blue got a text message my item was cancelled!!",
                "rating": 1
            },
            {
                "title": "Arrived Dented but works fine",
                "text": "I purchased the Refrigerator for $200 off the  original price. It was listed on clearance and  NOT as scratch and dent item,  therefore I did not expect it to arrive dented, as it did. However, wait a week for Walmart to come and pick up the fridge. I realize that the fridge works just fine and the damage was just cosmetic so I decided to keep it.",
                "rating": 3
            },
            {
                "title": "Perfect",
                "text": "So far havent had any issues with it and i love it for the price, i'm not too sure how long it'll last for or when it will break down but for now it's actually working really good, Im 5'6 and it's basically like up to my shoulders its also really quiet.",
                "rating": 5
            },
            {
                "title": "Mmm",
                "text": "I like it is a good product for the price the only problem is that have a dent one on the side the other on the front! I don't care for the one on the side but the one on the front really bothers me .",
                "rating": 2
            }
        ]
    },
    "15": {
        "product_id": "5265054314",
        "reviews": [
            {
                "title": "fingerprint scanner not available on this model",
                "text": "advertised as having a fingerprint scanner  but it did not have one. pretty solid for the price",
                "rating": 4
            },
            {
                "title": "Received Damaged",
                "text": "Shipping box damaged and product damaged. Electronics don’t need to be handled this rough. Returned. If the next one is shipped like this I will return again and buy elsewhere.",
                "rating": 1
            },
            {
                "title": "HP still my  favorite laptop.",
                "text": "I have had bought HP computers for years.. This is a great laptop for the $.  I am happy with all but one note for others. I was a little disappointed when Mcafee security was downloaded without my authorization so I deleted  it and added my paid Norton security I already had. Other than that all is great.  Recommend. 5 *****",
                "rating": 5
            },
            {
                "title": "Very good",
                "text": "None",
                "rating": 5
            },
            {
                "text": "The keys are large and the set up was easy. Just the thing for me as a Senior Citizen. I was able to set up without online tech support and my daughter only had to help me when I wanted to set up some apps that I have on my phone! Very nice, simple and it allows me the freedom of having a laptop that is economical and able to do all that I need to do🥰",
                "rating": 5
            },
            {
                "title": "W laptop",
                "text": "W laptop, runs light games smoothly and is perfect for my school work, fhe only thing I'm sad about is that the WASD buttons faded very quickly after me using it for about 3 days.  this might just be a me problem but it's not much of an issue",
                "rating": 4
            },
            {
                "title": "fingerprint scanner not available on this model",
                "text": "advertised as having a fingerprint scanner  but it did not have one. pretty solid for the price",
                "rating": 4
            },
            {
                "title": "Overheating",
                "text": "Everything seems to work pretty well. But the vent is on the bottom of the laptop causing it over heat a lot.",
                "rating": 3
            },
            {
                "title": "an ok laptop but I would have chosen differently",
                "text": "I had to get this laptop after my last laptop died on me; I am not the happiest with this laptop.  I was going to order an Asus with the same specs but as soon as I ordered the Asus the local store said it was out of stock.  So i bought this so I could get it the same day.  I was hesitant because I had bought two previous HP laptops; one I had to send in for warranty repair and that issue kept coming back and the other had a battery issue where the battery just went off a cliff after a less than a year.  This works ok for my needs but two things really stand out as a negative.  It took forever to make a back up drive of windows 11, it literally took the battery down to 20 percent or so because it took a few hours to complete.  I then wiped windows off the drive and installed linux mint.  And the battery is still bad.  I am regretting not getting the Asus now.   I will say the wi fi and hardware work well other than the battery.  I am able to play some lower demand games and older games on steam such as two point campus and planet zoo well.  I also don't have any issues with having ten or so tabs open on palemoon web broswer.  I don't really use the webcam so I havent tried anything with the cam.  I think the speaker(s) work well but I know some people are snobs about that.  Demanding the best on the cheaper products.  Having used this a few days, I wish I would have waited for the Asus laptop to ship instead of buying this laptop.    If your happy with HP/an HP fan, i would recommend this laptop for users who want to use this in a home office or for home schooling or for playing moderate to lower end games in a place they can plus it in.  Wont run the latest greatest games but most people would find this good for games they play.  I would not recommend for anyone wanting a laptop they can use all day without a charge.",
                "rating": 3
            },
            {
                "title": "DO NOT ORDER THIS COMPUTER!",
                "text": "Id give this computer 0 stars if I had the option. This computer worked for 2 MONTHS before now it completely stopped working. It never turned off completely!! even when it was sitting on the table unplugged it would die. Now It wont even turn on and I’m out $300 and a job since this was my work from home computer as I’m a stay at home mother of 2 children. DO NOT WASTE YOUR MONEY!!!!",
                "rating": 1
            },
            {
                "title": "Don't Buy This",
                "text": "I read reviews and allowed them to give me hope.. don't be me. The screen resolution is terrible, gives 2005 PC. The battery life is crazy, it will die overnight, fully charged and while not being used. It lags sometimes. I hate the default search engine it has, Bing; you have to know what you're looking for because Bing has no idea. And there's a slight difficulty in learning to use it because it has neither safari or chrome, the only default applications I'm used to using. At almost $300. you're better off getting another computer. I'm very disappointed, and sadly didn't buy the warranty due to the price point.. and the only way I could've returned this was to drop it off at a Walmart and there is not Walmart in my area. Don't buy this, I would've been better off buying a tablet with an attached keyboard for a fraction of the price I paid for this.",
                "rating": 1
            },
            {
                "title": "Received Damaged",
                "text": "Shipping box damaged and product damaged. Electronics don’t need to be handled this rough. Returned. If the next one is shipped like this I will return again and buy elsewhere.",
                "rating": 1
            },
            {
                "title": "Great little workhorse 9 out of 10",
                "text": "I really like this computer. It's sturdy, but light enough to be portable. It's not cumbersome or heavy. It loads pages fast even with multiple tabs open and YouTube playing. It charges fast and has hours and hours of battery life. There is an actual delete key so you don't have to go forward and then back to delete something. Also, there is no annoying touch screen to change screens at the slightest gesture when you least expect it. The only thing that would make it a 10 out of 10 is if it had lighted keys. Otherwise, for me, this is just right.",
                "rating": 5
            },
            {
                "text": "Worked fine but than today when I went to type my password in knowing it was right everytime I login to it it said that it didn’t work and everytime I go to set up my pin again or reset it it wouldn’t let me and say that I couldn’t right now and to try it again later.",
                "rating": 2
            },
            {
                "title": "Best laptop for the price point",
                "text": "I just turned this on yesterday. Everything works great. For the cheapest laptop on the market, you can’t expect great volume or graphics, but it’s good enough for my needs. I needed a new laptop asap as my second Dell in a year died last week. Never going back. This little $270 HP is much better than I expected and delivered within a day of ordering.",
                "rating": 5
            },
            {
                "text": "this is the worse laptop ever. I could not accomplish anything. did not alliw several google based apps to load or even install properly. i have always used HP desktop computers. when in need of a laptop U naturally went to that. \n\"Hate\" being a strong word. I hated this laptop. returned after crashed on thec3rd day.",
                "rating": 1
            },
            {
                "title": "Greedy Security Software",
                "text": "The laptop is nice, the blue finish is nice. It came with Windows 11 installed. I normally use Win 10, Win 11 is easy to use. Sadly, it comes with Mcafee security software hidden in the computer. I have used Zonealarm for many years and wanted to stick with one company. I used Win 11 to uninstall the software so that I could install the Zonealarm that I just purchased. The software would not install because Mcgreedy reinstalled its own software again but hide the software from the Win 11 uninstall feature. I returned the Zonealarm software that I just purchased and now I hope for a refund. I needed new security software, so I purchased Norton. The same thing happened when I tried to install it, security software is installed, and I still can't find it to use Win 11 to uninstall it. Luckily, Norton has a Feret program that finds the old software and creates a simple button to start the uninstall process. The Norton software was successfully installed. Other than the incredibly annoying, deceitful Mcgreedy security software, the computer works nice. I won't be using it with battery power so I can't comment on battery life. I use the HDMI to power a monitor and it works just fine. It took hours to copy the OS to the recovery drive, so be patient, hours. The input pad is like most others, clumsy, but the switch underneath works very well, a nice \"click\" when depressed. I would buy again but it has been less than a week and the durability has not been tested. Seems solid enough.",
                "rating": 5
            },
            {
                "title": "Great Laptop For the Price",
                "text": "I bought this laptop and received it on 4/20/24. I paid $279, but it was originally $519. The build is great for a laptop of this price. It feels high-end and that it will be durable.\n\nI'm a student, so the 14\" size is perfect for both functionality and portability. The 13th gen i3 processor is more than enough for what I'm using the laptop for.\n\nVery pleased with my purchase and would easily buy this again!",
                "rating": 5
            },
            {
                "title": "So far, it's pretty good",
                "text": "Set up took a long time, but was easy. I don't like the piles of bs that HP, and Windows load on it. That stuff accumulates, and is always running in the background. Most you can't get rid of. That's kinda unfair since I bought it, and they are running the show. They should pay me.",
                "rating": 4
            },
            {
                "text": "The computer will not accept the pin that I created and apparently this is a common malady with the operating system. I came back to the store and went to the computer department and Nesha and Israel tried to help me, but I was not able to follow the directions they gave me once I did get home to get the computer working. I likely will have to return this computer and start over again which is unfortunate.",
                "rating": 1
            },
            {
                "title": "HP failed to deliver with this laptop",
                "text": "The sound on this laptop is horrible! Even with headphones the sound is low and difficult to hear. I've done everything to adjust the sound to no avail. This laptop is only okay for use when I need to look something up. I mainly wanted it to stream movies when away from a tv. However, the sound is way too bad for that. I found this laptop to be way over priced for having such a small storage space and very little sound. I've never experienced such a bad computer from HP.  HP sure dropped the ball on this one!",
                "rating": 2
            },
            {
                "text": "The price was amazing. Was $**** and marked down to $****. Very easy to use, and it came the day after I purchased,  which I was not expecting, but saved my behind at work.",
                "rating": 5
            }
        ]
    },
    "16": {
        "product_id": "5144605689",
        "reviews": [
            {
                "title": "Amazing",
                "text": "[This review was collected as part of a promotion.] I honestly loved this  Chromebook I use it for school especially to take notes the pen comes in hand. Very light to carry in my backpack and was was walk around with it In my hands. I can have it set up as a lap top to watch videos.",
                "rating": 5
            },
            {
                "title": "Terrible Product",
                "text": "The only reason I purchased this Chromebook was to receive a stellar Google AI Premium offer; however, I could not redeem the offer because the device already redeemed the office. The security tape was neatly cut with a knife and I immediately suspected that Walmart or Asus shipped a used product instead of a new product. I will be returning the used product immediately. In my short time with the Chromebook, the keyboard reminded me of a flimsy surface keyboard. The keyboard only lays flat and not on an angle. The ergonomics will drive any user crazy. I'd avoid this product and get a Windows ARM laptop instead.",
                "rating": 1
            },
            {
                "title": "Stylish and portable",
                "text": "[This review was collected as part of a promotion.] Thank you Influenster and Asus for the free Chromebook/Vivobook. The tablet is convenient, lightweight, and portable. It comes with a detachable keyboard so you can switch from work to play. What I especially love is its portability, so I can bring it anywhere with me, whether it's for travel or bringing some overtime work to the beach. We actually brought it to the coast this weekend and I was able to finish all my emails while enjoying camping. The versatility is amazing.",
                "rating": 5
            },
            {
                "title": "I absolutely love it",
                "text": "[This review was collected as part of a promotion.] This Chromebook 10 and a half inch touch 2 in 1 tablet is really nice the quality is great I absolutely love the screen it is so crisp and clear the display quality is wonderful the battery life is good I watched a whole movie and I still had almost a full battery when it comes to storage it seems like it will hold a good amount and it does not lag the performance is really nice I absolutely love the styler that comes with it it has a little bit of a weight to it which makes it seem more luxurious you do have to charge the styler which I'm not used to but it's pretty nice and it doesn't take long to charge the tablet computer also the keyboard is so cool it pulls off and clicks back in like a magnet and the keys itself are easy to touch and move and also I love the fact that you can take pictures and they're pretty crisp as well the music is nice the volume gets to a good height but I would not say this is for anybody that likes Bass other than that I really like it it's great and I would say people that are in college would absolutely love it because of the apps that come with it",
                "rating": 5
            },
            {
                "title": "Wonderful for daily use and travel",
                "text": "[This review was collected as part of a promotion.] This is the best of both worlds!!  A laptop that transitions into a tablet so easily. I love how compact it is and lightweight to carry around for daily usage. I was impressed with the battery life considering how small it is and how well it performs. I loved the walk through to get me familiar with the product. The quality of the screen and throughout the websites, was so clear and precise.",
                "rating": 5
            },
            {
                "title": "Love it!",
                "text": "[This review was collected as part of a promotion.] Works great charged it the day I got it and haven't had to charge it since ! Great battery! Very nice and sleek design very aesthetically pleasing! It's like a mini laptop on the go and I love that it's magnetic!! And loving the touch screen!",
                "rating": 5
            },
            {
                "title": "I'm in love with this Chromebook 🥰",
                "text": "[This review was collected as part of a promotion.] \"I'm absolutely thrilled with my new Chromebook! Its compact size makes it so convenient to carry around, whether I'm on the go or lounging in bed catching up on shows. The screen's brightness and picture resolution are exceptional, making everything look incredibly crisp and vivid. Plus, it's lightweight yet sturdy, perfect for my active lifestyle. And the best part? It's surprisingly affordable!\"",
                "rating": 5
            },
            {
                "title": "Great quality",
                "text": "[This review was collected as part of a promotion.] I love this it's so easy to work and maneuver...it's great quality....Battery life is excellent it stays charged and everything on the screen is so clear ...it has of storage and overall it's a great tablet and I would highly recommend it...",
                "rating": 5
            },
            {
                "title": "Amazing",
                "text": "[This review was collected as part of a promotion.] I honestly loved this  Chromebook I use it for school especially to take notes the pen comes in hand. Very light to carry in my backpack and was was walk around with it In my hands. I can have it set up as a lap top to watch videos.",
                "rating": 5
            },
            {
                "title": "Review from a college student - 5 stars!!",
                "text": "[This review was collected as part of a promotion.] This 2-in-1 tablet is actually a necessity for any on the go college student. In 2 months, I've taken this Chromebook to class, lab, work, coffee shops and even on a cruise so I could use it to study for a midterm. It is so convenient and fits in my purse! It connects to the internet very fast and I love that all my google apps are so easily accessible. My favorite app is the cursive app which makes all my notes super easy to write and accessible from anywhere that I can log in to my google drive. The stylus that it comes with is pretty thin and lightweight so I was skeptical, but it was still comfortable to hold and write with. I love using it to study flashcards because I could download the Quizlet app on it. If you're switching between this and a full size laptop or desktop computer, the keyboard is smaller and does not have all keys (like caps lock for example) so it would be an adjustment. But when I'm home I like using this to watch lecture videos (the display quality and sound is great) and using a full size laptop to type notes or an assignment. It charges very fast with USB-C and stays charged for a long time compared to my laptop. I can see the felt-like magnetic stand attachment and keyboard getting dirty after a while but that's pretty much the only con. I wouldn't use this to do any big projects or papers on, but for everything else - this is my go to.",
                "rating": 5
            },
            {
                "title": "Great Tablet that Acts Like a Laptop",
                "text": "[This review was collected as part of a promotion.] I have been using the ASUS Chromebook for about a month and love it. It's great little workhorse — a tablet that can act like a lap top, with both a touch screen plus a key board. I will eventually try to add a wireless mouse. This is new to me as I have been a longtime Macbook user, so the touch screen is a big bonus for me. And this Chromebook has been so easy to use, right out of the box. It comes with a cover that props up like an easel to use as a lap top and for Zoom calls and such. And it's light enough to carry to a cafe when working remotely. Google Play makes it very easy to download apps. I cannot say enough good things about it.",
                "rating": 5
            },
            {
                "title": "Compact, fast, great for travel",
                "text": "[This review was collected as part of a promotion.] The things I love: \nThis is so lightweight and has a removable kickstand. It is super easy to set and charges using standard USB, so I don't need to carry an extra charger everywhere. \nThere is only one software update during setup, and the updates run in the background in the future. I love this because I always have to wait for updates on my current laptop. \nI am a teacher who uses Google Apps for everything. I love that Chromebook allows me to use my sign-in for everything and download apps through the Play Store. \n\nKeep in mind, based on size, it is definitely a tablet more than a laptop. Great for travel or working on the go, but you may want a bigger laptop or chromebook for work projects.",
                "rating": 4
            },
            {
                "title": "Sleek design and All in one computer",
                "text": "[This review was collected as part of a promotion.] Thr stylus function is great I didn't even know it was attached to the computer at first. Easy accessible. I love the weight of the product. The battery was charged was full within the first 15 minutes of being connected to a plug. It still has a full battery.",
                "rating": 5
            },
            {
                "title": "I love love love this Chromebook",
                "text": "[This review was collected as part of a promotion.] This is a really nice Chromebook. I love that it has a stylus because I love to draw and paint. The storage capacity is awesome and the battery life lasts forever. The screen is huge and easy to work on.",
                "rating": 5
            },
            {
                "title": "Super duper yay!!",
                "text": "[This review was collected as part of a promotion.] Super excited and still can't believe that I received this for free!! I've been wanting a tablet for the longest and just had not gotten to it! It feels like great quality and I love that it's easy to use. Multiple parts of it are magnetic which is great because I ended up dropping it and thought it was broken but it all snapped back together! My only downside is that I can't play Pokémon go on it,😭, but that's ok at least I can stream my shows/ movies on it.",
                "rating": 5
            },
            {
                "title": "Perfect for everyday tablet/laptop tasks",
                "text": "[This review was collected as part of a promotion.] This Chromebook is perfect for everyday tasks. I love how easy the stylus and keyboard are to use. The keyboard being removable is awesome when I want to use it as a tablet. I love how there is a back provided that makes it easy to stand my tablet up when I'm using it more like a laptop. I love how there is virus protection and how it updates automatically. The apps are easy to download & I can't wait to try out everything this tablet can offer.",
                "rating": 5
            },
            {
                "title": "LOVE IT",
                "text": "[This review was collected as part of a promotion.] Great design, runs well and holds battery life, easy to transport, and good quality graphics! It was super easy to bring to work in my bag and the display options were wonderful",
                "rating": 4
            },
            {
                "title": "Nothing",
                "text": "[This review was collected as part of a promotion.] Excellent build quality and design ⋅ Expertly handling heat and noise.Perfomance is excellent and easy to use.the battery life last a normal time I love it.",
                "rating": 5
            },
            {
                "title": "Great product!",
                "text": "[This review was collected as part of a promotion.] I love the built in stylus, removable keyboard, and switches to tablet/laptop super easily. It comes loaded with all the google apps needed, very easy setup",
                "rating": 5
            },
            {
                "title": "Chromebook",
                "text": "[This review was collected as part of a promotion.] This Chromebook is so sleek and very easy to use. I love that it came with a stylus so there's not so many fingerprints. It's become a staple for my small business. I couldn't be happier",
                "rating": 5
            },
            {
                "title": "All you need!",
                "text": "I like the overall design quality of the tablet and its functionality, however, its display is too small to accommodate all of its features without causing eye strain after a while. The RAM and ROM specifications are fantastic for the tablet's price. Returned!",
                "rating": 4
            },
            {
                "title": "Terrible Product",
                "text": "The only reason I purchased this Chromebook was to receive a stellar Google AI Premium offer; however, I could not redeem the offer because the device already redeemed the office. The security tape was neatly cut with a knife and I immediately suspected that Walmart or Asus shipped a used product instead of a new product. I will be returning the used product immediately. In my short time with the Chromebook, the keyboard reminded me of a flimsy surface keyboard. The keyboard only lays flat and not on an angle. The ergonomics will drive any user crazy. I'd avoid this product and get a Windows ARM laptop instead.",
                "rating": 1
            }
        ]
    },
    "17": {
        "product_id": "5053960359",
        "reviews": [
            {
                "title": "Iphone 15 pro",
                "text": "The iPhone 15 pro came out in September 2023, and many other devices were released in 2023, also including new software updates. The iPhone 15 pro is supposed to have a longer battery life, a new USB-C charger that charges faster than the previous chargers, and a new action button. The iPhone 15 costs $999 with 128GB, and with TB it is $1499.\nI had the iPhone 12 for about 3 years, and I noticed that it was time to upgrade my phone since my iPhone 12 was slow and lacked many of the newer updates. I upgrade my phone in late November or early December. The phone took a little longer than two weeks to arrive. When I finally got my phone and used it I immediately realized how much longer the battery life lasted, when I had the iPhone 12 I barely could make it through the day without it dying, but with the iPhone 15 pro, it lasts the entire day of school even with me being on it constantly. I also had the realization that it charged faster than my last and had a better reaction time when clicking or swiping out of tabs. However, the price of the phone is very pricey. I believe if you are looking to upgrade the iPhone 15 pro is great and I would rate a 5 if the price was more affordable but since it is not I believe it is a 4.5 stars overall. I would recommend you get the iPhone 15 pro.",
                "rating": 4
            },
            {
                "text": "the phone was cracked when i got it!!",
                "rating": 1
            },
            {
                "rating": 5
            },
            {
                "rating": 5
            },
            {
                "rating": 5
            },
            {
                "rating": 5
            },
            {
                "rating": 5
            }
        ]
    },
    "18": {
        "product_id": "1900999083",
        "reviews": [
            {
                "title": "Decent budget phone",
                "text": "Cant expect much from a smartphone this cheap. Taking that into consideration this is a decent device. Noticeably snappier than the Galaxy A02s it replaced. Took a star away cuz this phone was released just this month yet only comes out of the box with Android 12 with no update to 13 yet. The 3 navigation buttons are also opposite from the phones Ive used and cant be changed. Somewhat annoying. Surprised it came with both a charging cable as well as the plug in adapter. Bonus points there",
                "rating": 4
            },
            {
                "title": "crappy",
                "text": "box is damaged",
                "rating": 1
            },
            {
                "title": "EXCELLENT PHONE",
                "text": "Quality,ease of use, picture and video quality excellent, does everything the extremely over priced phones do at a GREAT PRICE.",
                "rating": 5
            },
            {
                "title": "Decent budget phone",
                "text": "Cant expect much from a smartphone this cheap. Taking that into consideration this is a decent device. Noticeably snappier than the Galaxy A02s it replaced. Took a star away cuz this phone was released just this month yet only comes out of the box with Android 12 with no update to 13 yet. The 3 navigation buttons are also opposite from the phones Ive used and cant be changed. Somewhat annoying. Surprised it came with both a charging cable as well as the plug in adapter. Bonus points there",
                "rating": 4
            },
            {
                "title": "its ok",
                "text": "its a ok little phone no real problem with it so far",
                "rating": 4
            },
            {
                "title": "upset",
                "text": "the phone is fine, but I ordered it for delivery so I wouldn't have to come to the store. Wasn't able to activate it because the store didn't scan correctly forcing me to return in person and purchase in person. Makes no since. What's th use of ordering phones for delivery if you have to end up going to the store in person anyway.",
                "rating": 4
            },
            {
                "title": "Nokia C300 Android",
                "text": "I have used this phone over 1 month already. WiFi and Bluetooth automatically are turned on several times, which I am not sure the reason. I am having doubt about using applications from this Android. Particularly Messages By Google. It seems that my messages can be leaked or read, and I also receive emails' contents similar to those messages sometimes from unknown senders.\nI will update later.",
                "rating": 3
            },
            {
                "title": "Good product. But service could've been better.",
                "text": "Product seemed very nice. Bought online. BUT, I had to return it because the employee forgot to scan it and it couldn't be activated. Frustrating because I now have to wait for return process to get a refund in order to purchase another one. Can only hope they don't forget again. Was given a $10 coupon for my trouble, but still would rather have new phone in hand instead.",
                "rating": 2
            },
            {
                "title": "doesnt work very good",
                "text": "i always have tk restart it and it goes super slow! do not recommend it ..",
                "rating": 1
            },
            {
                "title": "It's like dial up internet in your pocket",
                "text": "This phone comes equipped with incredibly low storage capacity. It struggles to open basic apps (a simple SMS is a feat) and no matter how fast your wifi you can count on this baddie to process as slowly as possible. You should absolutely make this purchase if you enjoy missing calls because your phone can't process your desire to answer before it goes to voicemail. On a positive note,  you absolutely CAN drop it without cracking the screen!!!",
                "rating": 1
            },
            {
                "title": "crappy",
                "text": "box is damaged",
                "rating": 1
            },
            {
                "text": "i will never buy another phone off line EVER AGAIN!!!!! This has been an absolutely nightmare!!! It was a gift for my husband. Walmart.com made the mistake and now we are told it cant be fixed!! So stupid, just nonsense!!!! NEVER AGAIN!!! I will not be using walmart.com if i cant find it in store order irder somewhere else then i guess i dont need it. thanks walmart.com for messing up my husbands Christmas gift.",
                "rating": 1
            },
            {
                "text": "the fact that straight talk said this phone is not compatible to them, I am confused and very unhappy.",
                "rating": 2
            },
            {
                "title": "CHILDREN'S FIRST PHONE",
                "text": "I had bought two of these phones for my boys for christmas.  These are their first cell phones and they both love them.",
                "rating": 4
            },
            {
                "title": "Negligence",
                "text": "Shannon picked and delivered the phone to my son and didn't scan it properly. Now he can't activate the phone 🙄 😒",
                "rating": 1
            },
            {
                "title": "Slow go C300",
                "text": "Very slow, waiting for apps to load is torture, as is every task with this phone. I've only had the phone afew weeks, Ive used Nokia for years from 3031 to N8, used to be great. I am really disappointed.",
                "rating": 4
            },
            {
                "title": "Nah",
                "text": "This is a decent temporary phone,which is why I bought it; It could definitely benefit from some more space because it fills up almost immediately, the main apps that are locked to the phone take up the first quarter of space.",
                "rating": 2
            },
            {
                "title": "Not Happy",
                "text": "I cannot activate this phone after receiving it on Friday.  I tried to activate online and by phone.  I was told that because this item has not been ran through scanner correctly.",
                "rating": 1
            },
            {
                "title": "was locked",
                "text": "was treated like i stole the phone",
                "rating": 1
            },
            {
                "text": "excellent delivery! thank you!",
                "rating": 5
            },
            {
                "text": "Well I wish I could activate my new phone I got but unfortunately Walmart took my money off my debit card but when I called straight talk to activate it they said they can't because Walmart didn't scan the phone properly so if they didn't scan my phone properly then how did they manage to take my money then..",
                "rating": 1
            },
            {
                "text": "Screen is right size and in great condition but not scanned right so I can't use it",
                "rating": 4
            }
        ]
    },
    "19": {
        "product_id": "706770009",
        "reviews": [
            {
                "text": "Great quality and delivery service is excellent",
                "rating": 5
            },
            {
                "title": "Disappointing",
                "text": "I bought this phone for my nephew for his birthday. His birthday was just this past Sunday and it was the first time we open the phone and the screen was cracked I log onto Walmart app and it says it's not eligible for return. All we really want to do is exchange it",
                "rating": 1
            },
            {
                "title": "total",
                "text": "i love it",
                "rating": 5
            },
            {
                "text": "Great quality and delivery service is excellent",
                "rating": 5
            },
            {
                "title": "phone works great! it came with the charger cable!",
                "text": "it works great and it's very Fast i would recommend on buying this product again!!",
                "rating": 5
            },
            {
                "title": "No charging block.",
                "text": "Doesn't come with a charging block… useless for it being a new phone that should come WITH a charger since it's not a usb charger but has the exact same on both ends. Otherwise no complaints so far",
                "rating": 3
            },
            {
                "title": "failed transaction",
                "text": "bought this phone for my inventory as my workers break theirs often. when came time to put into service they would not activate because \"not scanned properly\". past 45 days so cant return. wasted money. ill attempt to take it to the store that delivered it to see if the magic scan can be done. walmart should have replaced it.",
                "rating": 2
            },
            {
                "title": "Disappointing",
                "text": "I bought this phone for my nephew for his birthday. His birthday was just this past Sunday and it was the first time we open the phone and the screen was cracked I log onto Walmart app and it says it's not eligible for return. All we really want to do is exchange it",
                "rating": 1
            },
            {
                "title": "Useless people",
                "text": "Phone wasn't activated. Wouldn't let me set up service.",
                "rating": 1
            },
            {
                "title": "no",
                "text": "i just open my new cellphone box missing charger and cord what do i do",
                "rating": 1
            },
            {
                "text": "purchased the phone in store. Samsung should be ashamed of themselves. The phones memory is loaded 3/4 with bloatware so you have very little ram. The phone is extremely laggy it takes forever to power on. The apps take forever to load. i have mine through straight talk and my time though short has been problem after problem. I understand its not a top of the line phone but I have had $20 phones that were more reliable. This phone is just plane aweful. the memory is 32 gigs and 24.40 is system i have added a photo of that. Its just aweful as is straight talk.",
                "rating": 1
            },
            {
                "title": "Not so good experience",
                "text": "My phone seems to have issues downloading an update, that I did not ask for. The update started on it own. It's frozen %26 can't shut off?",
                "rating": 1
            },
            {
                "title": "Straight Talk unlocked.",
                "text": "Nice Phone. Straight Talk replacement but cannot keep old number. Wrong Sim.",
                "rating": 1
            },
            {
                "title": "Can't charge the phone",
                "text": "The phone came with no Charger or the  right Charger Cord for a USB Android phone. Which means I  have to spend more money if I  want to use it. Or keep the phone",
                "rating": 1
            },
            {
                "title": "Samsung",
                "text": "you didn't send me a plug for my charger all that was in the box was the phone and a 2 way cord no plug for the wall otherwise it was good i called in and thy transferred my number from the old phone to the new one",
                "rating": 4
            },
            {
                "title": "Charger",
                "text": "I've noticed a lot of complaints about the charger cord they gave for this phone and the fact it came with no adapter. Well turns out that charging cord is meant to be plugged into the same adapter meant to be used for iPhone chargers. Find you an iPhone adapter and you will be good to go.",
                "rating": 5
            },
            {
                "text": "I love the phone. But it did not come with a charging device. It came with a wire with 2  small ends, and no plug. I'm going to contact store to see if they will correct this problem.  And deliver it. I don't drive due to the meds I'm on. \nWe'll see what happens",
                "rating": 2
            },
            {
                "text": "Hi.. I'm so happy , because my phone gets here early and working so good I'll recommend thanks Walmart",
                "rating": 5
            },
            {
                "title": "Don't buy unless you specify charger included",
                "text": "Messing the most important component, the actual plug in charger! Brand-new phone and I can't even charge it",
                "rating": 1
            },
            {
                "title": "Please do NOT even try!",
                "text": "I bought this phone thinking it is \"Samsung\".  It equip with low quality TN screen with slow MTK P35 that can't even run a single app Messenger without hiccup. I even ADB disabled more than 20 SAMSUNG BLOATWARE, and it still running like 15 year old PC. By all mean, get Motorola or Nokia if you want an inexpensive phone.   I end up replaced it with Moto G Power in less than 2 months.  ( I tried to put up with it, I just can't )",
                "rating": 1
            },
            {
                "title": "Activate the phone",
                "text": "In order to activate the phone I need to scan it out of the store I need help to scan the item",
                "rating": 1
            },
            {
                "title": "Not satisfied",
                "text": "The phone only works in the use and I ordered an unlocked phone",
                "rating": 1
            }
        ]
    }
}